{
    "resourceType": "StructureDefinition",
    "id": "de-Contract.term.action.intent",
    "meta": {
        "lastUpdated": "2019-11-01T09:29:23.356+11:00"
    },
    "url": "http://hl7.org/fhir/StructureDefinition/de-Contract.term.action.intent",
    "version": "4.0.1",
    "name": "Contract.term.action.intent",
    "title": "Contract.term.action.intent",
    "status": "draft",
    "experimental": true,
    "date": "2019-11-01T09:29:23+11:00",
    "publisher": "HL7 FHIR Standard",
    "contact": [
        {
            "telecom": [
                {
                    "system": "url",
                    "value": "http://hl7.org/fhir"
                }
            ]
        }
    ],
    "description": "Data Element for Contract.term.action.intent",
    "purpose": "Data Elements are defined for each element to assist in questionnaire construction etc",
    "fhirVersion": "4.0.1",
    "mapping": [
        {
            "identity": "workflow",
            "uri": "http://hl7.org/fhir/workflow",
            "name": "Workflow Pattern"
        },
        {
            "identity": "rim",
            "uri": "http://hl7.org/v3",
            "name": "RIM Mapping"
        },
        {
            "identity": "w5",
            "uri": "http://hl7.org/fhir/fivews",
            "name": "FiveWs Pattern Mapping"
        }
    ],
    "kind": "logical",
    "abstract": false,
    "type": "Contract.term.action.intent",
    "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
    "derivation": "specialization",
    "snapshot": {
        "element": [
            {
                "id": "Contract.term.action.intent",
                "path": "Contract.term.action.intent",
                "short": "Purpose for the Contract Term Action",
                "definition": "Reason or purpose for the action stipulated by this Contract Provision.",
                "min": 1,
                "max": "1",
                "base": {
                    "path": "Contract.term.action.intent",
                    "min": 1,
                    "max": "1"
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "isModifier": false,
                "isSummary": false,
                "binding": {
                    "extension": [
                        {
                            "url": "http://hl7.org/fhir/StructureDefinition/elementdefinition-bindingName",
                            "valueString": "ContractActionReason"
                        }
                    ],
                    "strength": "example",
                    "description": "Detailed codes for the contract action reason.",
                    "valueSet": "http://terminology.hl7.org/ValueSet/v3-PurposeOfUse"
                },
                "mapping": [
                    {
                        "identity": "workflow",
                        "map": "Request.reasonCode"
                    },
                    {
                        "identity": "w5",
                        "map": "FiveWs.why[x]"
                    },
                    {
                        "identity": "rim",
                        "map": "Examples from ActReason Concept Domains: ActCoverageReason Description:Codes used to specify reasons or criteria relating to coverage provided under a policy or program. May be used to convey reasons pertaining to coverage contractual provisions, including criteria for eligibility, coverage limitations, coverage maximums, or financial participation required of covered parties. ActInformationPrivacyReason Description: The rationale or purpose for an act relating to the management of personal information, such as disclosing personal tax information for the purpose of complying with a court order. ClinicalResearchObservationReason Definition: Specifies the reason that a test was performed or observation collected in a clinical research study. SafetyInvestigationReportReasonType Description: Possible reasons generating a report providing information developed during the investigation of an adverse event or a product problem. ControlActReason Description: Indicates the motivation, cause or rationale of an Act which results in a trigger event.  NonPerformanceReasonCode Description: The reason the action was not performed, e.g. why the medication was not taken. If an action was not performed, it is often clinically important to know why the action was not taken. RefusalReasonCode Description: Identifies why a request to add (or activate) a record is being refused. Examples include the receiving system not able to match the identifier and find that record in the receiving system, having no permission, or a detected issue exists which precludes the requested action.\r\r\r\r\r\r\r\rExamples from HL7 ActReason Code System: QUALIMP (quality improvement) Description:Operational activities conducted for the purposes of improving the quality of an activity, product, or service. _PatientProfileQueryReasonCode Description: A collection of concepts identifying why the patient's profile is being queried. _ActInformationManagementReason Description:The rationale or purpose for an act relating to information management, such as archiving information for the purpose of complying with an enterprise data retention policy. _ActInvalidReason (ActInvalidReason) Description: Types of reasons why a substance is invalid for use. _NonPerformanceReasonCode Description: The reason the action wasn't performed, e.g. why the medication was not taken. If an action wasn\"t performed, it is often clinically important to know why the action wasn\"t taken."
                    }
                ]
            }
        ]
    }
}