{
	"resourceType": "ValueSet",
	"id": "FDANationalDrugCode",
	"text": {
		"status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
	},
	"url": "http://hl7.org/fhir/us/davinci-pdex/ValueSet/FDANationalDrugCode",
	"version": "2.0.0-ballot",
	"name": "FDANationalDrugCode",
	"title": "FDA National Drug Code (NDC)",
	"status": "active",
	"date": "2022-02-20T12:46:42+00:00",
	"publisher": "HL7 Financial Management Working Group",
	"contact": [
		{
			"name": "HL7 Financial Management Working Group",
			"telecom": [
				{
					"system": "url",
					"value": "http://www.hl7.org/Special/committees/fm"
				},
				{
					"system": "email",
					"value": "fm@lists.HL7.org"
				}
			]
		},
		{
			"name": "Mark Scrimshire (mark.scrimshire@onyxhealth.io)",
			"telecom": [
				{
					"system": "email",
					"value": "mailto:mark.scrimshire@onyxhealth.io"
				}
			]
		},
		{
			"name": "HL7 International - Financial Management",
			"telecom": [
				{
					"system": "url",
					"value": "http://www.hl7.org/Special/committees/fm"
				}
			]
		}
	],
	"description": "The Drug Listing Act of 1972 requires registered drug establishments to provide the Food and Drug Administration (FDA) with a current list of all drugs manufactured, prepared, propagated, compounded, or processed by it for commercial distribution.  (See Section 510 of the Federal Food, Drug, and Cosmetic Act (Act) (21 U.S.C. ยง 360)). Drug products are identified and reported using a unique, three-segment number, called the National Drug Code (NDC), which serves as a universal product identifier for drugs. FDA publishes the listed NDC numbers and the information submitted as part of the listing information in the NDC Directory which is updated daily.\n\nThe information submitted as part of the listing process, the NDC number, and the NDC Directory are used in the implementation and enforcement of the Act.\n\nUsers should note:\n\nStarting June 1, 2011, only drugs for which electronic listings (SPL) have been submitted to the FDA are included in the NDC Directory. Drugs for which listing information was last submitted to FDA on paper forms, prior to June 2009, are included on a separate file and will not be updated after June 2012.\n\nInformation regarding the FDA published NDC Directory can be found [here](https://www.fda.gov/drugs/drug-approvals-and-databases/national-drug-code-directory)\n\nUsers should note a few important items\n\n*   The NDC Directory is updated daily.\n*   The new NDC Directory contains ONLY information on final marketed drugs submitted to the FDA in SPL electronic listing files by labelers.\n*   The NDC Directory does not contain all listed drugs. The new version includes the final marketed drugs which listing information were submitted electronically. It does not include animal drugs, blood products, or human drugs that are not in final marketed form, such as Active Pharmaceutical Ingredients(APIs), drugs for further processing, drugs manufactured exclusively for a private label distributor, or drugs that are marketed solely as part of a kit or combination product or inner layer of a multi-level packaged product not marketed individually. For more information about how certain kits or multi-level packaged drugs are addressed in the new NDC Directory, see the NDC Directory Package File definitions document. For the FDA Online Label Repository page and additional resources go to: [FDA Online Label Repository](https://labels.fda.gov/)",
	"jurisdiction": [
		{
			"coding": [
				{
					"system": "urn:iso:std:iso:3166",
					"code": "US",
					"display": "United States of America"
				}
			]
		}
	],
	"copyright": "NDC codes have no copyright acknowledgment or license requirements.",
	"compose": {
		"include": [
			{
				"system": "http://hl7.org/fhir/sid/ndc"
			}
		]
	}
}