{
    "resourceType": "StructureDefinition",
    "id": "de-Contract.contentDerivative",
    "meta": {
        "lastUpdated": "2019-11-01T09:29:23.356+11:00"
    },
    "url": "http://hl7.org/fhir/StructureDefinition/de-Contract.contentDerivative",
    "version": "4.0.1",
    "name": "Contract.contentDerivative",
    "title": "Contract.contentDerivative",
    "status": "draft",
    "experimental": true,
    "date": "2019-11-01T09:29:23+11:00",
    "publisher": "HL7 FHIR Standard",
    "contact": [
        {
            "telecom": [
                {
                    "system": "url",
                    "value": "http://hl7.org/fhir"
                }
            ]
        }
    ],
    "description": "Data Element for Contract.contentDerivative",
    "purpose": "Data Elements are defined for each element to assist in questionnaire construction etc",
    "fhirVersion": "4.0.1",
    "mapping": [
        {
            "identity": "workflow",
            "uri": "http://hl7.org/fhir/workflow",
            "name": "Workflow Pattern"
        },
        {
            "identity": "rim",
            "uri": "http://hl7.org/v3",
            "name": "RIM Mapping"
        },
        {
            "identity": "w5",
            "uri": "http://hl7.org/fhir/fivews",
            "name": "FiveWs Pattern Mapping"
        }
    ],
    "kind": "logical",
    "abstract": false,
    "type": "Contract.contentDerivative",
    "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
    "derivation": "specialization",
    "snapshot": {
        "element": [
            {
                "id": "Contract.contentDerivative",
                "path": "Contract.contentDerivative",
                "short": "Content derived from the basal information",
                "definition": "The minimal content derived from the basal information source at a specific stage in its lifecycle.",
                "requirements": "In the context of a contract, the information source of the content derivative shall be the information referenced by the contract.binding.\rThe Contract Resource may function simply as the computable representation of the executed contract, which may be the attached to the Contract Resource as the “binding” or as the “friendly” electronic form.  For example, a Contract Resource may be automatically populated with the values expressed in a related QuestionnaireResponse. \rHowever, the Contract Resource may be considered the legally binding contract if it is the only “executed” form of this contract, and includes the signatures as *The Contract Resource may function as the computable representation of an application or offer in a pre-executed Contract if the grantor has not entered any values.  In this case, it is populated with values in a “legal” form of the application or offer or by the values in an associated Questionnaire.  If the grantor has filled in the legal form or the associated Questionnaire Response, then these values are used to populate a pre-executed Contract Resource.\rIf the Contract.topic is considered an application or offer, then the policy is often required to be attached as the “legal” basis for the application to ensure “informed consent” to the contract, and that any discrepancy between the application and the policy are interpreted against the policy.  Implementers should check organizational and jurisdictional policies to determine the relationship among multiple representations of a contract pre- and post-execution.",
                "min": 0,
                "max": "1",
                "base": {
                    "path": "Contract.contentDerivative",
                    "min": 0,
                    "max": "1"
                },
                "type": [
                    {
                        "code": "CodeableConcept"
                    }
                ],
                "isModifier": false,
                "isSummary": false,
                "binding": {
                    "extension": [
                        {
                            "url": "http://hl7.org/fhir/StructureDefinition/elementdefinition-bindingName",
                            "valueString": "ContractContentDerivative"
                        }
                    ],
                    "strength": "example",
                    "description": "This is an example set of Content Derivative type codes, which represent the minimal content derived from the basal information source.",
                    "valueSet": "http://hl7.org/fhir/ValueSet/contract-content-derivative"
                },
                "mapping": [
                    {
                        "identity": "w5",
                        "map": "FiveWs.what[x]"
                    },
                    {
                        "identity": "rim",
                        "map": "Maps partially to several v3 codes: ActClass: REG (registration) Description: Represents the act of maintaining information about the registration of its associated registered subject. The subject can be either an Act or a Role, and includes subjects such as lab exam definitions, drug protocol definitions, prescriptions, persons, patients, practitioners, and equipment.\rThe registration may have a unique identifier - separate from the unique identification of the subject - as well as a core set of related participations and act relationships that characterize the registration event and aid in the disposition of the subject information by a receiving system. Observation: VERIF (Verification) Description: An act which describes the process whereby a 'verifying party' validates either the existence of the Role attested to by some Credential or the actual Vetting act and its details. TRFR (transfer) Description: The act of transferring information without the intent of imparting understanding about a topic to the subject that is the recipient or holder of the transferred information where the participation association must be RCV or HLD. _ActDetectedIssueManagementCode [abstract term] Description: Codes dealing with the management of Detected Issue observations. _ActInformationAccessContextCode [abstract term] Description: Concepts conveying the context in which authorization given under jurisdictional law, by organizational policy, or by a patient consent directive permits the collection, access, use or disclosure of specified patient health information. _ActListCode [abstract term]vDescription: Provides codes associated with ActClass value of LIST (working list). RefusalReasonCode [abstract term] Description:\rDescription: Identifies why a request to add (or activate) a record is being refused. Examples include the receiving system not able to match the identifier and find that record in the receiving system, having no permission, or a detected issue exists which precludes the requested action."
                    }
                ]
            }
        ]
    }
}