{
    "resourceType": "CodeSystem",
    "id": "v3-hgnc",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://www.genenames.org",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.6.281"
        }
    ],
    "version": "2.0.0",
    "name": "Hgnc",
    "title": "HUGO Gene Nomenclature",
    "status": "active",
    "experimental": false,
    "date": "2019-03-20T00:00:00-04:00",
    "publisher": "HUGO Gene Nomenclature Committee (HGNC)",
    "description": "HUGO Gene Nomenclature Committee (HGNC) is committee jointly funded by the US National Human Genome Research Institute and the Wellcome Trust (UK). It operates under the auspices of HUGO, with key policy advice from an International Advisory Committee, and is responsible for approving gene names and symbols. All approved symbols are stored in the HGNC database. Each symbol is unique and each gene is only given one approved gene symbol. More than 28,000 human gene symbols and names have been approved so far. The vast majority of these is for protein-coding genes, but also includes symbols for peudogenes, non-coding RNAs, phenotypes and genomic features.\r\n\r\nHGNC gene symbols can be used with the HL7 coded data type. For example, in the HL7 messages specified according to the HL7 V2 Clinical Genomics Fully LOINC-Qualified Genetic Variation Model Implementation Guide, HGNC gene symbols can be used to as the observation values for gene identifiers. For example, OBX|1|CWE|48018-6^Gene identifier^||BRCA1^HGNC|\r\n\r\nVersioning Information: The version of the HGNC database is reported using the last updated date and timestamp. The last updated date and timestamp is posted on the main HGNC Search screen in the format like \"Monday March 30 23:00:56 2009\".\r\n\r\nHGNC is updated daily.\r\n\r\nHGNC is a free database for the public.",
    "content": "not-present"
}