{
    "resourceType": "CodeSystem",
    "id": "v3-rxNorm",
    "language": "en",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "extension": [
        {
            "url": "http://hl7.org/fhir/StructureDefinition/codesystem-properties-mode",
            "valueCode": "not-present"
        }
    ],
    "url": "http://www.nlm.nih.gov/research/umls/rxnorm",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.6.88"
        }
    ],
    "version": "3.0.0",
    "name": "RxNorm",
    "title": "RxNorm",
    "status": "active",
    "date": "2020-11-03",
    "publisher": "National Library of Medicine (NLM)",
    "contact": [
        {
            "name": "National Library of Medicine (NLM)",
            "telecom": [
                {
                    "system": "email",
                    "value": "rxnorminfo@nlm.nih.gov"
                }
            ]
        }
    ],
    "description": "RxNorm provides normalized names for clinical drugs and links its names to many of the drug vocabularies commonly used in pharmacy management and drug interaction software, including those of First Databank, Micromedex, and Gold Standard Drug Database. By providing links between these vocabularies, RxNorm can mediate messages between systems not using the same software and vocabulary. RxNorm now includes the United States Pharmacopeia (USP) Compendial Nomenclature from the United States Pharmacopeial Convention. USP is a cumulative data set of all Active Pharmaceutical Ingredients (API).",
    "copyright": "Using RxNorm codes of type SAB=RXNORM as this specification describes does not require  a UMLS license. Access to the full set of RxNorm definitions, and/or additional use of other RxNorm structures and information requires a UMLS license. The use of RxNorm in this specification is pursuant to HL7's status as a licensee of the NLM UMLS. HL7's license does not convey the right to use RxNorm to any users of this specification; implementers must acquire a license to use RxNorm in their own right.",
    "content": "not-present"
}