{
    "resourceType": "CodeSystem",
    "id": "RadLex",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://radlex.org/",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.6.256"
        }
    ],
    "version": "1.0.0",
    "name": "RadLex",
    "title": "RadLex radiology lexicon",
    "status": "active",
    "experimental": false,
    "date": "2022-01-26T00:00:00-00:00",
    "publisher": "RSNA (Radiological Society of North America)",
    "contact": [
        {
            "name": "RSNA (Radiological Society of North America); 820 Jorie Blvd., Suite 200, Oak Brook, IL 60523-2251 USA",
            "telecom": [
                {
                    "system": "email",
                    "value": "informatics@rsna.org"
                },
                {
                    "system": "url",
                    "value": "https://www.rsna.org/"
                },
                {
                    "system": "phone",
                    "value": "1-800-381-6660"
                }
            ]
        }
    ],
    "description": "RadLex is a comprehensive set of radiology terms for use in radiology reporting, decision support, data mining, data registries, education and research.\r\n\r\nRadLex Playbook is a project of the Radiological Society of North America (RSNA), and constitutes a portion of the RadLex ontology. Playbook aims to provide a standard system for naming radiology procedures, based on the elements which define an imaging exam such as modality and body part. By providing standard names and codes for radiologic studies, Playbook is intended to facilitate a variety of operational and quality improvement efforts, including workflow optimization, chargemaster management, radiation dose tracking, enterprise integration and image exchange.\r\n\r\nAs of RadLex Playbook version 2.5, a four-year project to harmonize RadLex Playbook with the radiology portion of the LOINC standard has been concluded, leading to the LOINC-RSNA Radiology Playbook which is jointly managed by the Regenstrief Institute (publisher of LOINC) and RSNA. This harmonized Playbook defines a new information model for describing imaging procedures, and identifies correspondences between RadLex Playbook codes and LOINC codes. (See https://loinc.org/download/loinc-users-guide and http://pubs.rsna.org/doi/pdf/10.1148/rg.2017160188 for details.) Note that RadLex Playbook codes start with \"RPID\" followed by a numerical value. LOINC codes consist of a numerical code, followed by a hyphen and a single additional digit (called the check digit). Note that in the future, new codes will be created in the LOINC format only, not the RPID format. New adopters are encouraged to use LOINC-format codes.\r\n\r\nLOINC-format codes may be accessed at http://search.loinc.org. New code requests may be submitted to the joint Regenstrief-RSNA governance committee at https://loinc.org/submissions/. \r\n\r\nFrom the RSNA website:\r\n\r\n\"We (RSNA) recognize the benefits that come from radiologists using common language to communicate diagnostic results. For this reason, RSNA produced RadLex®, a comprehensive set of radiology terms for use in radiology reporting, decision support, data mining, data registries, education and research.\r\n\r\nRadLex provides the foundation for vital data resources used in radiology:#13;\n\r\n *  The LOINC/RSNA Radiology Playbook (http://playbook.radlex.org/playbook/SearchRadlexAction) #13;\n *  RadElement Common Data Elements (http://www.radelement.org/) \r\n *  RadReport Radiology Reporting Templates (http://radreport.org/) \r\n\r\nThe development of RadLex has been supported by the National Institute of Biomedical Imaging and Bioengineering (NIBIB) and the cancer Biomedical Informatics Grid (caBIG) project.;\"",
    "copyright": "Copyright 2014 – The Radiological Society of North America (RSNA), all rights reserved. Licensed under RadLex License Version 2.0. You may obtain a copy of the license at: http://www.rsna.org/radlexdownloads/ \r\n\r\nThis work is distributed under the above noted license on an “AS IS” basis, WITHOUT WARRANTIES OF ANY KIND, either express or implied. Please see the license for complete terms and conditions.\r\n\r\nSubject to the terms and conditions of this Agreement, Licensor hereby grants to You a worldwide, non-exclusive, no-charge, royalty-free copyright license to reproduce, prepare Adaptations of, publicly display, publicly perform, sublicense, and distribute the Work and such Adaptations in any medium.#13;\n\r\nRadLex is licensed freely for commercial and non-commercial users. Review and download the license: http://www.rsna.org/uploadedFiles/RSNA/Content/Informatics/RadLex_License_Agreement_and_Terms_of_Use_V2_Final.pdf",
    "content": "not-present"
}