{
    "resourceType": "CodeSystem",
    "id": "CDCREC",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "urn:oid:2.16.840.1.113883.6.238",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.6.238"
        }
    ],
    "version": "3.0.0",
    "name": "CDCREC",
    "title": "CDC Race and Ethnicity",
    "status": "active",
    "experimental": false,
    "date": "2021-09-01T00:00:00-04:00",
    "publisher": "U.S. Centers for Disease Control and Prevention (CDC)",
    "contact": [
        {
            "name": "U.S. Centers for Disease Control and Prevention (CDC)",
            "telecom": [
                {
                    "system": "email",
                    "value": "phinvs@cdc.gov"
                },
                {
                    "system": "url",
                    "value": "https://www.cdc.gov/vaccines/programs/iis/index.html"
                }
            ]
        }
    ],
    "description": "The U.S. Centers for Disease Control and Prevention (CDC) has prepared a code set for use in coding race and ethnicity data. This code set is based on current federal standards for classifying data on race and ethnicity, specifically the minimum race and ethnicity categories defined by the U.S. Office of Management and Budget (OMB) and a more detailed set of race and ethnicity categories maintained by the U.S. Bureau of the Census (BC). The main purpose of the code set is to facilitate use of federal standards for classifying data on race and ethnicity when these data are exchanged, stored, retrieved, or analyzed in electronic form. At the same time, the code set can be applied to paper-based record systems to the extent that these systems are used to collect, maintain, and report data on race and ethnicity in accordance with current federal standards.\r\n\r\nThe content is available at https://phinvads.cdc.gov/vads/ViewCodeSystem.action?id=2.16.840.1.113883.6.238#.",
    "copyright": "Most of the information on the CDC and ATSDR websites is not subject to copyright, is in the public domain, and may be freely used or reproduced without obtaining copyright permission.\r\n\r\nFor information and exceptions regarding use of CDC material please see https://www.cdc.gov/other/agencymaterials.html.",
    "content": "not-present"
}