{
    "resourceType": "CodeSystem",
    "id": "InsuranceProductTypeCS",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://hl7.org/fhir/us/davinci-pdex-plan-net/CodeSystem/InsuranceProductTypeCS",
    "version": "1.1.0",
    "name": "InsuranceProductTypeCS",
    "title": "Insurance Product Type",
    "status": "active",
    "date": "2022-04-04T14:02:01+00:00",
    "publisher": "HL7 Financial Management Working Group",
    "contact": [
        {
            "name": "HL7 Financial Management Working Group",
            "telecom": [
                {
                    "system": "url",
                    "value": "http://www.hl7.org/Special/committees/fm"
                },
                {
                    "system": "email",
                    "value": "fm@lists.HL7.org"
                }
            ]
        }
    ],
    "description": "A distinct package of health insurance coverage benefits that are offered using a particular product network type.",
    "jurisdiction": [
        {
            "coding": [
                {
                    "system": "urn:iso:std:iso:3166",
                    "code": "US"
                }
            ]
        }
    ],
    "caseSensitive": true,
    "content": "complete",
    "count": 22,
    "concept": [
        {
            "code": "commppo",
            "display": "Commercial PPO",
            "definition": "Health insurance provided through a Preferred Provider Organization (PPO)."
        },
        {
            "code": "commhdhp",
            "display": "Commercial HDHP",
            "definition": "Health insurance provided through a High Deductible Health Plan (HDHP)."
        },
        {
            "code": "commpos",
            "display": "Commercial POS",
            "definition": "Health insurance provided through a Point-of-Service (POS) Plan."
        },
        {
            "code": "commhmo",
            "display": "Commercial HMO",
            "definition": "Health insurance provided through a Health Maintenance Organization (HMO)."
        },
        {
            "code": "commepo",
            "display": "Commercial EPO",
            "definition": "Health insurance provided through a Exclusive Provider Organization(EPO)."
        },
        {
            "code": "medi",
            "display": "Medicaid",
            "definition": "Health insurance provided to eligible adults and children under the Federal Medicaid program"
        },
        {
            "code": "medihmo",
            "display": "Medicaid HMO",
            "definition": "Health insurance provided to eligible adults and children under the Federal Medicaid program through a Health Maintenance Organization (HMO)."
        },
        {
            "code": "mediadv",
            "display": "Medicare Advantage",
            "definition": "Health insurance provided by a private company that contracts with Medicare to provide all Medicare Part A and Part B benefits."
        },
        {
            "code": "mediadvhmo",
            "display": "Medicare Advantage HMO",
            "definition": "Health insurance offered by a private company that contracts with Medicare to provide all Medicare Part A and Part B benefits through a Health Maintenance Organization (HMO)."
        },
        {
            "code": "media",
            "display": "Medicare Part A",
            "definition": "Health insurance provided under the Federal Medicare program covering inpatient hospital stays, care in a skilled nursing facility, hospice care, and some home health care."
        },
        {
            "code": "medib",
            "display": "Medicare Part B",
            "definition": "Health insurance provided under the Federal Medicfare program covering certain doctors' services, outpatient care, medical supplies, and preventive services."
        },
        {
            "code": "medid",
            "display": "Medicare Part D",
            "definition": "Health insurance provided under the Federal Medicare program covering prescription drugs."
        },
        {
            "code": "mediab",
            "display": "Medicare A/B",
            "definition": "Health insurance provided under the Federal Medicare program covering inpatient hospital stays, care in a skilled nursing facility, hospice care, some home health care, certain doctors' services, outpatient care, medical supplies, and preventive services."
        },
        {
            "code": "qhp",
            "display": "Qualified Health Plan",
            "definition": "Health insurance provided through and certified by the Health Insurance Marketplace that provides essential health benefits (EHBs), follows established limits on cost sharing, and meets other requirements outlined within the application process."
        },
        {
            "code": "ihs",
            "display": "Indian Health Service",
            "definition": "Health care program provided to United States American Indians and Alaska Natives."
        },
        {
            "code": "fep",
            "display": "Federal Employee Program",
            "definition": "Health insurance provided to employees of the Federal government."
        },
        {
            "code": "tri",
            "display": "TRICARE",
            "definition": "Health care program provided to uniformed service members, retirees, and their families around the world."
        },
        {
            "code": "va",
            "display": "Veterans Affairs Plan",
            "definition": "Health care program provided to eligible veterans."
        },
        {
            "code": "dent",
            "display": "Dental Plan",
            "definition": "Health insurance provided to cover services related to the study, diagnosis, prevention, and treatment of diseases, disorders, and conditions of the oral cavity."
        },
        {
            "code": "denthmo",
            "display": "Dental HMO",
            "definition": "Health insurance provided to cover services related to the study, diagnosis, prevention, and treatment of diseases, disorders, and conditions of the oral cavity provided through a Health Maintenance Organization (HMO)."
        },
        {
            "code": "vis",
            "display": "Vision Plan",
            "definition": "Health insurance provided to cover services related to the study, diagnosis, prevention, and treatment of diseases, disorders, and conditions of the eyes."
        },
        {
            "code": "vishmo",
            "display": "Vision HMO",
            "definition": "Health insurance provided to cover services related to the study, diagnosis, prevention, and treatment of diseases, disorders, and conditions of the eyes provided through a Health Maintenance Organization (HMO)."
        }
    ]
}