{
    "resourceType": "ValueSet",
    "id": "AHANUBCPointOfOriginForAdmissionOrVisit",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://hl7.org/fhir/us/carin-bb/ValueSet/AHANUBCPointOfOriginForAdmissionOrVisit",
    "version": "1.0.0",
    "name": "AHANUBCPointOfOriginForAdmissionOrVisit",
    "title": "NUBC Point Of Origin",
    "status": "active",
    "date": "2020-11-23T16:49:10+00:00",
    "publisher": "HL7 Financial Management Working Group",
    "contact": [
        {
            "name": "HL7 Financial Management Working Group",
            "telecom": [
                {
                    "system": "url",
                    "value": "http://www.hl7.org/Special/committees/fm/index.cfm"
                },
                {
                    "system": "email",
                    "value": "fm@lists.HL7.org"
                }
            ]
        }
    ],
    "description": "The UB-04 Data File contains the complete set of NUBC codes. Every code in the range of possible codes is accounted for sequentially. There are no gaps because all used and unused codes are identified.\n\nThis code system consists of the following:\n\n*   FL 15 - Point of Origin for Admission or Visit \n\nThese codes are used to convey the patient point of origin for an admission or visit and are the property of the American Hospital Association\n\nTo obtain the underlying code systems, please see information [here](https://www.nubc.org/subscription-information)",
    "jurisdiction": [
        {
            "coding": [
                {
                    "system": "urn:iso:std:iso:3166",
                    "code": "US"
                }
            ]
        }
    ],
    "copyright": "Licensing information can be found [here](https://www.nubc.org/license).\n\nThese codes are listed within the UB-04 Data Specifications Manual. The Official UB-04 Data Specifications Manual, copyrighted by the American Hospital Association, is the only official source of UB-04 billing information adopted by the National Uniform Billing Committee. No other publication—governmental or private/commercial—can be considered authoritative. The AHA wants to make you aware that the use of codes, descriptions, or any other content contained in the manual to be used in a software application, publication, or any other derivative work must be properly licensed by the AHA. If your organization uses or intends to use any of the codes or other related content from the manual in this manner, please contact the AHA’s licensing manager, Tim Carlson, at 312.893.6816 or email tcarlson@aha.org",
    "compose": {
        "include": [
            {
                "system": "https://www.nubc.org/CodeSystem/PointOfOrigin"
            }
        ]
    }
}