{
    "resourceType": "ValueSet",
    "id": "X12ClaimAdjustmentReasonCodesCMSRemittanceAdviceRemarkCodes",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://hl7.org/fhir/us/carin-bb/ValueSet/X12ClaimAdjustmentReasonCodesCMSRemittanceAdviceRemarkCodes",
    "version": "1.0.0",
    "name": "X12ClaimAdjustmentReasonCodesCMSRemittanceAdviceRemarkCodes",
    "title": "X12 Claim Adjustment Reason Codes - Remittance Advice Remark Codes",
    "status": "active",
    "date": "2020-11-23T16:49:10+00:00",
    "publisher": "HL7 Financial Management Working Group",
    "contact": [
        {
            "name": "HL7 Financial Management Working Group",
            "telecom": [
                {
                    "system": "url",
                    "value": "http://www.hl7.org/Special/committees/fm/index.cfm"
                },
                {
                    "system": "email",
                    "value": "fm@lists.HL7.org"
                }
            ]
        }
    ],
    "description": "X12, chartered by the American National Standards Institute for more than 40 years, develops and maintains EDI standards and XML schemas which drive business processes globally. X12's diverse membership includes technologists and business process experts in health care, insurance, transportation, finance, government, supply chain and other industries.\n\nThe X12 Claim Adjustment Reason Codes describe why a claim or service line was paid differently than it was billed. These codes are listed within an X12 implementation guide (TR3) and maintained by X12.\n\nRemittance Advice Remark Codes (RARCs) are used to provide additional explanation for an adjustment already described by a Claim Adjustment Reason Code (CARC) or to convey information about remittance processing.\n\nEach RARC identifies a specific message as shown in the Remittance Advice Remark Code List. There are two types of RARCs, supplemental and informational. The majority of the RARCs are supplemental; these are generally referred to as RARCs without further distinction. Supplemental RARCs provide additional explanation for an adjustment already described by a CARC. The second type of RARC is informational; these RARCs are all prefaced with Alert: and are often referred to as Alerts. Alerts are used to convey information about remittance processing and are never related to a specific adjustment or CARC.\n\nExternal code lists maintained by X12 and external code lists maintained by others and distributed by WPC on behalf of the maintainer can be found here:\n\n[https://x12.org/codes](https://x12.org/codes)\n\nClick on the name of any external code list to access more information about the code list, view the codes, or submit a maintenance request. These external code lists were previously published on either [www.wpc-edi.com/reference](http://www.wpc-edi.com/reference) or [www.x12.org/codes](http://www.x12.org/codes).",
    "jurisdiction": [
        {
            "coding": [
                {
                    "system": "urn:iso:std:iso:3166",
                    "code": "US"
                }
            ]
        }
    ],
    "copyright": "**Intellectual Property Information**\n\nAll X12 products are subject to this IP policy, including published and draft works.\n\nX12 is the only organization authorized to grant permission for use of X12 products. Users of all X12 products should make sure that they understand the permissible uses, as well as the limitations on such usage, as outlined below.\n\nAdditional IP information can be found here: [https://x12.org/products/ip-use](https://x12.org/products/ip-use)\n\n**Licensing Information**\n\nSend an email to ip@x12.org to request permission to reproduce X12 IP. Include your name, organization, title, address, city, state, zip, email, a detailed description of the Submitted Artifact, including the underlying or cited X12 Product, and a detailed description of the intended audience and planned distribution method for the Artifact.\n\nAdditional information on X12 licensing program can be found here:\n\n[https://x12.org/products/licensing-program](https://x12.org/products/licensing-program)\n\n**Purchasing Information:**\n\nTo purchase code list subscriptions call (425) 562-2245 or email admin@wpc-edi.com\n\nThe Centers for Medicare & Medicaid Services (CMS) maintain Remittance Advice Remark Codes (RARC) used throughout the US health care industry.",
    "compose": {
        "include": [
            {
                "system": "https://x12.org/codes/claim-adjustment-reason-codes"
            },
            {
                "system": "https://x12.org/codes/remittance-advice-remark-codes"
            }
        ]
    }
}