{
    "resourceType": "ValueSet",
    "id": "CMSICD910PCSProcedureCodes",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://hl7.org/fhir/us/carin-bb/ValueSet/CMSICD910PCSProcedureCodes",
    "version": "1.0.0",
    "name": "CMSICD910PCSProcedureCodes",
    "title": "Procedure Codes - International Classification of Diseases, Ninth Revision, Clinical Modification (ICD-9-CM) - ICD-10 Procedure Coding System",
    "status": "active",
    "date": "2020-11-23T16:49:10+00:00",
    "publisher": "HL7 Financial Management Working Group",
    "contact": [
        {
            "name": "HL7 Financial Management Working Group",
            "telecom": [
                {
                    "system": "url",
                    "value": "http://www.hl7.org/Special/committees/fm/index.cfm"
                },
                {
                    "system": "email",
                    "value": "fm@lists.HL7.org"
                }
            ]
        }
    ],
    "description": "The Value Set is a combination of values from volume 3 from the Code System International Classification of Diseases, Ninth Revision, Clinical Modification (ICD-9-CM) and values in the Code System ICD-10 Procedure Coding System. \n\nThe International Classification of Diseases, Ninth Revision, Clinical Modification (ICD-9-CM) is based on the World Health Organization’s Ninth Revision, International Classification of Diseases (ICD-9). ICD-9-CM was the official system of assigning codes to diagnoses and procedures associated with hospital utilization in the United States. \n\nThe ICD-9-CM consists of:\n\n*   a tabular list containing a numerical list of the disease code numbers in tabular form;\n*   an alphabetical index to the disease entries; and\n*   a classification system for surgical, diagnostic, and therapeutic procedures (alphabetic index and tabular list).\n\nThe National Center for Health Statistics (NCHS) and the [Centers for Medicare and Medicaid Services](http://www.cms.hhs.gov/) are the U.S. governmental agencies responsible for overseeing all changes and modifications to the ICD-9-CM.\n\nThe ICD-10-PCS is the replacement for ICD-9-CM, volume 3, effective October 1, 2015.\n\nThe ICD-10-PCS is a procedure classification published by the United States Centers for Medicare & Medicaid Services (CMS) ([https://www.cms.gov](https://www.cms.gov/)) for classifying procedures  \nperformed in hospital inpatient health care settings.\n\nCurrent and previous releases of ICD-9-CM are available here: [https://www.cdc.gov/nchs/icd/icd9cm.htm](https://www.cdc.gov/nchs/icd/icd9cm.htm)\n\nMost files are provided in compressed zip format for ease in downloading. These files have been created by the National Center for Health Statistics (NCHS), under authorization by the World Health Organization. Any questions regarding typographical or other errors noted on this release may be reported to [nchsicd10cm@cdc.gov](mailto:nchsicd10cm@cdc.gov).\n\nA link to information about the ICD-10-PCS code system - including how to obtain the content - is available at [https://www.cms.gov/Medicare/Coding/ICD10.](https://www.cms.gov/Medicare/Coding/ICD10)\n\nNote: CMS is the owner of the ICD-10-PCS code system. CMS is NOT the owner of ICD-10-CM. CMS republishes the ICD-10-CM codes system on their website for convienence only. For authoratative information on ICD-10-CM, users should refer to the National Center for Health Statistics (NCHS) site located [here](https://www.cdc.gov/nchs/icd/icd10cm.htm).",
    "jurisdiction": [
        {
            "coding": [
                {
                    "system": "urn:iso:std:iso:3166",
                    "code": "US"
                }
            ]
        }
    ],
    "copyright": "ICD-9 copyright:\n\nThe following requirements must be followed to utilize CDC’s public domain content:\n\n1) Attribution to the agency that developed the material must be provided in your use of the materials. Such attribution should clearly state the materials were developed by CDC ATSDR and/or HHS (e.g., Source: CDC; Materials developed by CDC);\n\n2) You must utilize a disclaimer which clearly indicates that your use of the material, including any links to the materials on the CDC, ATSDR or HHS websites, does not imply endorsement by CDC, ATSDR, HHS or the United States Government of you, your company, product, facility, service or enterprise. All such disclaimers must be prominently and unambiguously displayed (e.g., Reference to specific commercial products, manufacturers, companies, or trademarks does not constitute its endorsement or recommendation by the U.S. Government, Department of Health and Human Services, or Centers for Disease Control and Prevention;\n\n3) You may not change the substantive content of the materials; and\n\n4) You must state that the material is otherwise available on the agency website for no charge.\n\nFor information on NCHS agency level use of materials see [here](https://www.cdc.gov/other/agencymaterials.html).\n\nICD-10-PCS copyright:\n\nThe CMS licenses its published material in order to encourage maximum use and dissemination. See  \nthe CMS ([https://www.cms.gov/Medicare/Coding/ICD10](https://www.cms.gov/Medicare/Coding/ICD10)) web site for more information.",
    "compose": {
        "include": [
            {
                "system": "http://www.cms.gov/Medicare/Coding/ICD10"
            },
            {
                "system": "http://www.cms.gov/Medicare/Coding/ICD9"
            }
        ]
    }
}