{"resourceType":"CodeSystem","id":"v3-RoleClass","language":"en","text":{"status":"extensions","div":"<div xml:lang=\"en\" xmlns=\"http://www.w3.org/1999/xhtml\" lang=\"en\"><p><b>Properties</b></p><table class=\"grid\"><tr><td><b>Code</b></td><td><b>URL</b></td><td><b>Type</b></td><td><b>Description</b></td></tr><tr><td>Specializes</td><td/><td>Coding</td><td>The child code is a more narrow version of the concept represented by the parent code.  I.e. Every child concept is also a valid parent concept.  Used to allow determination of subsumption.  Must be transitive, irreflexive, antisymmetric.</td></tr><tr><td>Generalizes</td><td/><td>Coding</td><td>Inverse of Specializes.  Only included as a derived relationship.</td></tr><tr><td>internalId</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#v3-internal-id</td><td>code</td><td>The internal identifier for the concept in the HL7 Access database repository.</td></tr><tr><td>status</td><td>http://hl7.org/fhir/concept-properties#status</td><td>code</td><td>A property that indicates the status of the concept. One of active, experimental, deprecated, or retired.</td></tr><tr><td>deprecationDate</td><td>http://hl7.org/fhir/concept-properties#deprecationDate</td><td>dateTime</td><td>The date at which a concept was deprecated. Concepts that are deprecated but not inactive can still be used, but their use is discouraged.</td></tr><tr><td>Name:Class</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Class</td><td>code</td><td>The formal name for the class clone under this code</td></tr><tr><td>Name:Role:player:Entity</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Role-player</td><td>code</td><td>The name of the relationship from Role to the payer Entity</td></tr><tr><td>Name:Role:scoper:Entity</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Role-scoper</td><td>code</td><td>The name of the relationship from Role to the scoper Entity</td></tr><tr><td>Sort:Entity:playedRole:Role</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-played-sort</td><td>code</td><td>Sort key for the relationship from the Entity to the playedRole</td></tr><tr><td>Sort:Entity:scopedRole:Role</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-scoped-sort</td><td>code</td><td>The sort key for the relationship from the Entity to the scopedRole</td></tr><tr><td>Name:Entity:playedRole:Role</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-played</td><td>string</td><td>The name of the relationship from the Entity to the playedRole</td></tr><tr><td>Name:Entity:scopedRole:Role</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-scoped</td><td>string</td><td>The name of the relationship from the Entity to the scopedRole</td></tr><tr><td>Name:Participation:role:Role</td><td>http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Participation-role</td><td>string</td><td>The name of the relationship from Participation to Role</td></tr><tr><td>notSelectable</td><td>http://hl7.org/fhir/concept-properties#notSelectable</td><td>boolean</td><td>Indicates that the code is abstract - only intended to be used as a selector for other concepts</td></tr></table><p>This code system http://terminology.hl7.org/CodeSystem/v3-RoleClass defines the following codes:</p><table class=\"codes\"><tr><td><b>Lvl</b></td><td style=\"white-space:nowrap\"><b>Code</b></td><td><b>Display</b></td><td><b>Definition</b></td><td><b>Deprecated</b></td><td><b>internalId</b></td><td><b>status</b></td><td><b>deprecationDate</b></td><td><b>Name:Class</b></td><td><b>Name:Role:player:Entity</b></td><td><b>Name:Role:scoper:Entity</b></td><td><b>Sort:Entity:playedRole:Role</b></td><td><b>Sort:Entity:scopedRole:Role</b></td><td><b>Name:Entity:playedRole:Role</b></td><td><b>Name:Entity:scopedRole:Role</b></td><td><b>Name:Participation:role:Role</b></td><td><b>Not Selectable</b></td></tr><tr><td>1</td><td style=\"white-space:nowrap\">ROL<a name=\"v3-RoleClass-ROL\"> </a></td><td>role</td><td>Corresponds to the Role class</td><td/><td>13940</td><td>active</td><td/><td>role</td><td>(playing&amp;)|player</td><td>(scoping&amp;)|scoper</td><td>A________</td><td>A________</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>2</td><td style=\"white-space:nowrap\">  _RoleClassAssociative<a name=\"v3-RoleClass-_RoleClassAssociative\"> </a></td><td>RoleClassAssociative</td><td>A general association between two entities that is neither partitive nor ontological.</td><td/><td>21113</td><td>active</td><td/><td>associatedEntity</td><td>associated&amp;</td><td>scoping&amp;</td><td>AA_______</td><td>AA_______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td>true</td></tr><tr><td>3</td><td style=\"white-space:nowrap\">    _RoleClassMutualRelationship<a name=\"v3-RoleClass-_RoleClassMutualRelationship\"> </a></td><td>RoleClassMutualRelationship</td><td>A relationship that is based on mutual behavior of the two Entities as being related. The basis of such relationship may be agreements (e.g., spouses, contract parties) or they may be *de facto* behavior (e.g. friends) or may be an incidental involvement with each other (e.g. parties over a dispute, siblings, children).</td><td/><td>21114</td><td>active</td><td/><td>relatedEntity</td><td>related&amp;</td><td>scoping&amp;</td><td>AAA______</td><td>AAA______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td>true</td></tr><tr><td>4</td><td style=\"white-space:nowrap\">      _RoleClassRelationshipFormal<a name=\"v3-RoleClass-_RoleClassRelationshipFormal\"> </a></td><td>RoleClassRelationshipFormal</td><td>A relationship between two entities that is formally recognized, frequently by a contract or similar agreement.</td><td/><td>21118</td><td>active</td><td/><td>formalRelation</td><td>related&amp;</td><td>related&amp;</td><td>AAAA_____</td><td>AAAA_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td>true</td></tr><tr><td>5</td><td style=\"white-space:nowrap\">        AFFL<a name=\"v3-RoleClass-AFFL\"> </a></td><td>affiliate</td><td>Player of the Affiliate role has a business/professional relationship with scoper. Player and scoper may be persons or organization. The Affiliate relationship does not imply membership in a group, nor does it exist for resource scheduling purposes.\r\n\r\n*Example:* A healthcare provider is affiliated with another provider as a business associate.</td><td/><td>21438</td><td>active</td><td/><td>affiliate</td><td>affiliate&amp;</td><td>affiliated&amp;</td><td>AAAAR____</td><td>AAAAR____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        AGNT<a name=\"v3-RoleClass-AGNT\"> </a></td><td>agent</td><td>An entity (player) that acts or is authorized to act on behalf of another entity (scoper).</td><td/><td>14006</td><td>active</td><td/><td>agent</td><td>agent&amp;</td><td>(represented&amp;)|representee</td><td>AAAAD____</td><td>AAAAD____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          ASSIGNED<a name=\"v3-RoleClass-ASSIGNED\"> </a></td><td>assigned entity</td><td>An agent role in which the agent is an Entity acting in the employ of an organization. The focus is on functional role on behalf of the organization, unlike the Employee role where the focus is on the 'Human Resources' relationship between the employee and the organization.</td><td/><td>11595</td><td>active</td><td/><td>assignedEntity</td><td>(assigned&amp;)|assignee</td><td>(represented&amp;)|representee</td><td>AAAADA___</td><td>AAAADA___</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>7</td><td style=\"white-space:nowrap\">            COMPAR<a name=\"v3-RoleClass-COMPAR\"> </a></td><td>commissioning party</td><td>An Entity that is authorized to issue or instantiate permissions, privileges, credentials or other formal/legal authorizations.</td><td/><td>21303</td><td>active</td><td/><td>commissioningParty</td><td>commissioning&amp;</td><td>commissioningScoper</td><td>AAAADAC__</td><td>AAAADAC__</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>7</td><td style=\"white-space:nowrap\">            SGNOFF<a name=\"v3-RoleClass-SGNOFF\"> </a></td><td>signing authority or officer</td><td>The role of a person (player) who is the officer or signature authority for of a scoping entity, usually an organization (scoper).</td><td/><td>14007</td><td>active</td><td/><td>signatureAuthority</td><td>signing(&amp;|Authority)</td><td>(represented&amp;)|representee</td><td>AAAADAB__</td><td>AAAADAB__</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          CON<a name=\"v3-RoleClass-CON\"> </a></td><td>contact</td><td>A person or an organization (player) which provides or receives information regarding another entity (scoper). Examples; patient NOK and emergency contacts; guarantor contact; employer contact.</td><td/><td>12205</td><td>active</td><td/><td>contactParty</td><td>contact(&amp;|Party)</td><td>(represented&amp;)|representee</td><td>AAAADAA__</td><td>AAAADAA__</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>7</td><td style=\"white-space:nowrap\">            ECON<a name=\"v3-RoleClass-ECON\"> </a></td><td>emergency contact</td><td>An entity to be contacted in the event of an emergency.</td><td/><td>19140</td><td>active</td><td/><td>emergencyContact</td><td>emergencyContact(&amp;|Party)</td><td>(represented&amp;)|representee</td><td>AAAADAAB_</td><td>AAAADAAB_</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>7</td><td style=\"white-space:nowrap\">            NOK<a name=\"v3-RoleClass-NOK\"> </a></td><td>next of kin</td><td>An individual designated for notification as the next of kin for a given entity.</td><td/><td>19141</td><td>active</td><td/><td>nextOfKin</td><td>nextOfKinContact&amp;</td><td>(represented&amp;)|representee</td><td>AAAADAAA_</td><td>AAAADAAA_</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          GUARD<a name=\"v3-RoleClass-GUARD\"> </a></td><td>guardian</td><td>Guardian of a ward</td><td/><td>16324</td><td>active</td><td/><td>guardian</td><td>guardian&amp;</td><td>ward&amp;</td><td>AAAADB___</td><td>AAAADB___</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        CIT<a name=\"v3-RoleClass-CIT\"> </a></td><td>citizen</td><td>Citizen of apolitical entity</td><td/><td>11568</td><td>active</td><td/><td>citizen</td><td>citizen&amp;</td><td>political(&amp;|Entity)</td><td>AAAAF____</td><td>AAAAF____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        COVPTY<a name=\"v3-RoleClass-COVPTY\"> </a></td><td>covered party</td><td>A role class played by a person who receives benefit coverage under the terms of a particular insurance policy. The underwriter of that policy is the scoping entity. The covered party receives coverage because of some contractual or other relationship with the holder of that policy.\r\n\r\n*Discussion:*This reason for coverage is captured in 'Role.code' and a relationship link with type code of indirect authority should be included using the policy holder role as the source, and the covered party role as the target.\r\n\r\nNote that a particular policy may cover several individuals one of whom may be, but need not be, the policy holder. Thus the notion of covered party is a role that is distinct from that of the policy holder.</td><td/><td>14011</td><td>active</td><td/><td>coveredParty</td><td>covered(&amp;|Party)</td><td>(underwriting&amp;)|underwriter</td><td>AAAAI____</td><td>AAAAI____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          CLAIM<a name=\"v3-RoleClass-CLAIM\"> </a></td><td>claimant</td><td>**Description:** A role played by a party making a claim for coverage under a policy or program. A claimant must be either a person or organization, or a group of persons or organizations. A claimant is not a named insured or a program eligible.\r\n\r\n**Discussion:** With respect to liability insurance such as property and casualty insurance, a claimant must file a claim requesting indemnification for a loss that the claimant considers covered under the policy of a named insured. The claims adjuster for the policy underwriter will review the claim to determine whether the loss meets the benefit coverage criteria under a policy, and base any indemnification or coverage payment on that review. If a third party is liable in whole or part for the loss, the underwriter may pursue third party liability recovery. A claimant may be involved in civil or criminal legal proceedings involving claims against a defendant party that is indemnified by an insurance policy or to protest the finding of a claims adjustor. With respect to life insurance, a beneficiary designated by a named insured becomes a claimant of the proceeds of coverage, as in the case of a life insurance policy. However, a claimant for coverage under life insurance is not necessarily a designated beneficiary.\r\n\r\n**Note:** A claimant is not a named insured. However, a named insured may make a claim under a policy, e.g., an insured driver may make a claim for an injury under his or her comprehensive automobile insurance policy. Similarly, a program eligible may make a claim under program, e.g., an unemployed worker may claim benefits under an unemployment insurance program, but parties playing these covered party role classes are not, for purposes of this vocabulary and in an effort to clearly distinguish role classes, considered claimants.\r\n\r\nIn the case of a named insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that either a named insured or an individual insured has filed a claim for a loss. In the case of a program eligible, a role type code INJWKR (injured worker) subtypes the class to indicate that the covered party in a workers compensation program is an injured worker, and as such, has filed a &quot;claim&quot; under the program for benefits. Likewise, a covered role type code UNEMP (unemployed worker) subtypes the program eligible class to indicate that the covered party in an unemployment insurance program has filed a claim for unemployment benefits.\r\n\r\n**Example:** A claimant under automobile policy that is not the named insured.</td><td/><td>21955</td><td>active</td><td/><td>claimant</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          NAMED<a name=\"v3-RoleClass-NAMED\"> </a></td><td>named insured</td><td>**Description:** A role played by a party to an insurance policy to which the insurer agrees to indemnify for losses, provides benefits for, or renders services. A named insured may be either a person, non-person living subject, or an organization, or a group of persons, non-person living subjects, or organizations.\r\n\r\n**Discussion:** The coded concept NAMED should not be used where a more specific child concept in this Specializable value set applies. In some cases, the named insured may not be the policy holder, e.g., where a policy holder purchases life insurance policy in which another party is the named insured and the policy holder is the beneficiary of the policy.\r\n\r\n**Note:** The party playing the role of a named insured is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a named insured may make a claim under a policy, e.g., e.g., a party that is the named insured and policy holder under a comprehensive automobile insurance policy may become the claimant for coverage under that policy e.g., if injured in an automobile accident and there is no liable third party. In the case of a named insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that a named insured has filed a claim for a loss.\r\n\r\n**Example:** The named insured under a comprehensive automobile, disability, or property and casualty policy that is the named insured and may or may not be the policy holder.</td><td/><td>21957</td><td>active</td><td/><td>namedInsured</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>7</td><td style=\"white-space:nowrap\">            DEPEN<a name=\"v3-RoleClass-DEPEN\"> </a></td><td>dependent</td><td>**Description:** A role played by a person covered under a policy or program based on an association with a subscriber, which is recognized by the policy holder.\r\n\r\n**Note:** The party playing the role of a dependent is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a dependent may make a claim under a policy, e.g., a dependent under a health insurance policy may become the claimant for coverage under that policy for wellness examines or if injured and there is no liable third party. In the case of a dependent making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that the dependent has filed a claim for services covered under the health insurance policy.\r\n\r\n**Example:** The dependent has an association with the subscriber such as a financial dependency or personal relationship such as that of a spouse, or a natural or adopted child. The policy holder may be required by law to recognize certain associations or may have discretion about the associations. For example, a policy holder may dictate the criteria for the dependent status of adult children who are students, such as requiring full time enrollment, or may recognize domestic partners as dependents. Under certain circumstances, the dependent may be under the indirect authority of a responsible party acting as a surrogate for the subscriber, for example, if the subscriber is differently abled or deceased, a guardian ad Lidem or estate executor may be appointed to assume the subscriberaTMs legal standing in the relationship with the dependent.</td><td/><td>21960</td><td>active</td><td/><td>dependent</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>7</td><td style=\"white-space:nowrap\">            INDIV<a name=\"v3-RoleClass-INDIV\"> </a></td><td>individual</td><td>**Description:** A role played by a party covered under a policy as the policy holder. An individual may be either a person or an organization.\r\n\r\n**Note:** The party playing the role of an individual insured is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a named insured may make a claim under a policy, e.g., a party that is the named insured and policy holder under a comprehensive automobile insurance policy may become the claimant for coverage under that policy if injured in an automobile accident and there is no liable third party. In the case of an individual insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that an individual insured has filed a claim for a loss.\r\n\r\n**Example:** The individual insured under a comprehensive automobile, disability, or property and casualty policy that is the policy holder.</td><td/><td>21958</td><td>active</td><td/><td>individual</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>7</td><td style=\"white-space:nowrap\">            SUBSCR<a name=\"v3-RoleClass-SUBSCR\"> </a></td><td>subscriber</td><td>**Description:** A role played by a person covered under a policy based on association with a sponsor who is the policy holder, and whose association may provide for the eligibility of dependents for coverage.\r\n\r\n**Discussion:** The policy holder holds the contract with the policy or program underwriter. The subscriber holds a certificate of coverage under the contract. In legal proceedings concerning the policy or program, the terms of the contract takes precedence over the terms of the certificate of coverage if there are any inconsistencies.\r\n\r\n**Note:** The party playing the role of a subscriber is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a subscriber may make a claim under a policy, e.g., a subscriber under a health insurance policy may become the claimant for coverage under that policy for wellness examines or if injured and there is no liable third party. In the case of a subscriber making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that the subscriber has filed a claim for services covered under the health insurance policy.\r\n\r\n**Example:** An employee or a member of an association.</td><td/><td>21959</td><td>active</td><td/><td>subscriber</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          PROG<a name=\"v3-RoleClass-PROG\"> </a></td><td>program eligible</td><td>**Description:** A role played by a party that meets the eligibility criteria for coverage under a program. A program eligible may be either a person, non-person living subject, or an organization, or a group of persons, non-person living subjects, or organizations.\r\n\r\n**Discussion:** A program as typically government administered coverage for parties determined eligible under the terms of the program.\r\n\r\n**Note:** The party playing a program eligible is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However a program eligible may make a claim under program, e.g., an unemployed worker may claim benefits under an unemployment insurance program, but parties playing these covered party role classes are not, for purposes of this vocabulary and in an effort to clearly distinguish role classes, considered claimants.\r\n\r\nIn the case of a program eligible, a role type code INJWKR (injured worker) subtypes the class to indicate that the covered party in a workers compensation program is an injured worker, and as such, has filed a &quot;claim&quot; under the program for benefits. Likewise, a covered role type code UNEMP (unemployed worker) subtypes the program eligible class to indicate that the covered party in an unemployment insurance program has filed a claim for unemployment benefits.\r\n\r\n**Example:** A party meeting eligibility criteria related to health or financial status, e.g., in the U.S., persons meeting health, demographic, or financial criteria established by state and federal law are eligible for Medicaid.</td><td/><td>21956</td><td>active</td><td/><td>programEligible</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        CRINV<a name=\"v3-RoleClass-CRINV\"> </a></td><td>clinical research investigator</td><td>A role played by a provider, always a person, who has agency authority from a Clinical Research Sponsor to direct the conduct of a clinical research trial or study on behalf of the sponsor.</td><td/><td>19164</td><td>active</td><td/><td>clinicalResearchInvestigator</td><td>investigator&amp;</td><td>sponsoring&amp;</td><td>AAAAH____</td><td>AAAAH____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        CRSPNSR<a name=\"v3-RoleClass-CRSPNSR\"> </a></td><td>clinical research sponsor</td><td>A role played by an entity, usually an organization, that is the sponsor of a clinical research trial or study. The sponsor commissions the study, bears the expenses, is responsible for satisfying all legal requirements concerning subject safety and privacy, and is generally responsible for collection, storage and analysis of the data generated during the trial. No scoper is necessary, as a clinical research sponsor undertakes the role on its own authority and declaration. Clinical research sponsors are usually educational or other research organizations, government agencies or biopharmaceutical companies.</td><td/><td>19165</td><td>active</td><td/><td>clinicalResearchSponsor</td><td>sponsor&amp;</td><td>sponsorshipAuthorizing&amp;</td><td>AAAAG____</td><td>AAAAG____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        EMP<a name=\"v3-RoleClass-EMP\"> </a></td><td>employee</td><td>A relationship between a person or organization and a person or organization formed for the purpose of exchanging work for compensation. The purpose of the role is to identify the type of relationship the employee has to the employer, rather than the nature of the work actually performed. (Contrast with AssignedEntity.)</td><td/><td>11569</td><td>active</td><td/><td>employment</td><td>employee&amp;</td><td>employer&amp;</td><td>AAAAE____</td><td>AAAAE____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          MIL<a name=\"v3-RoleClass-MIL\"> </a></td><td>military person</td><td>A role played by a member of a military service. Scoper is the military service (e.g. Army, Navy, Air Force, etc.) or, more specifically, the unit (e.g. Company C, 3rd Battalion, 4th Division, etc.)</td><td/><td>11570</td><td>active</td><td/><td>militaryPerson</td><td>military&amp;</td><td>militaryService(&amp;-ORG)</td><td>AAAAEA___</td><td>AAAAEA___</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        GUAR<a name=\"v3-RoleClass-GUAR\"> </a></td><td>guarantor</td><td>A person or organization (player) that serves as a financial guarantor for another person or organization (scoper).</td><td/><td>13941</td><td>active</td><td/><td>guarantor</td><td>guarantor&amp;</td><td>promisor&amp;</td><td>AAAAJ____</td><td>AAAAJ____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        INVSBJ<a name=\"v3-RoleClass-INVSBJ\"> </a></td><td>Investigation Subject</td><td>An entity that is the subject of an investigation. This role is scoped by the party responsible for the investigation.</td><td/><td>21464</td><td>active</td><td/><td>investigativeSubject</td><td>subject&amp;</td><td>investigationSponsor</td><td>AAAAB____</td><td>AAAAB____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          CASEBJ<a name=\"v3-RoleClass-CASEBJ\"> </a></td><td>Case Subject</td><td>A person, non-person living subject, or place that is the subject of an investigation related to a notifiable condition (health circumstance that is reportable within the applicable public health jurisdiction)</td><td/><td>21465</td><td>active</td><td/><td>caseSubject</td><td>subject&amp;</td><td>caseMonitor</td><td>AAAABA___</td><td>AAAABA___</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          RESBJ<a name=\"v3-RoleClass-RESBJ\"> </a></td><td>research subject</td><td>**Definition:**Specifies the administrative functionality within a formal experimental design for which the ResearchSubject role was established.\r\n\r\n**Examples:** Screening - role is used for pre-enrollment evaluation portion of the design; enrolled - role is used for subjects admitted to the experimental portion of the design.</td><td/><td>19166</td><td>active</td><td/><td>researchSubject</td><td>subject&amp;</td><td>researchSponsor</td><td>AAAABB___</td><td>AAAABB___</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        LIC<a name=\"v3-RoleClass-LIC\"> </a></td><td>licensed entity</td><td>A relationship in which the scoper certifies the player ( e. g. a medical care giver, a medical device or a provider organization) to perform certain activities that fall under the jurisdiction of the scoper (e.g., a health authority licensing healthcare providers, a medical quality authority certifying healthcare professionals).</td><td/><td>16773</td><td>active</td><td/><td>licensedEntity</td><td>subject&amp;</td><td>(issuing&amp;)|issuer</td><td>AAAAC____</td><td>AAAAC____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          NOT<a name=\"v3-RoleClass-NOT\"> </a></td><td>notary public</td><td/><td/><td>11576</td><td>active</td><td/><td>notaryPublic</td><td>notaryPublic&amp;</td><td>political(&amp;|Entity)</td><td>AAAACB___</td><td>AAAACB___</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          PROV<a name=\"v3-RoleClass-PROV\"> </a></td><td>healthcare provider</td><td>An Entity (player) that is authorized to provide health care services by some authorizing agency (scoper).</td><td/><td>11599</td><td>active</td><td/><td>healthCareProvider</td><td>healthCare(&amp;|Provider)</td><td>(issuing&amp;)|issuer</td><td>AAAACA___</td><td>AAAACA___</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        PAT<a name=\"v3-RoleClass-PAT\"> </a></td><td>patient</td><td>A Role of a LivingSubject (player) as an actual or potential recipient of health care services from a healthcare provider organization (scoper).\r\n\r\n*Usage Note:* Communication about relationships between patients and specific healthcare practitioners (people) is not done via scoper. Instead this is generally done using the CareProvision act. This allows linkage between patient and a particular healthcare practitioner role and also allows description of the type of care involved in the relationship.</td><td/><td>11577</td><td>active</td><td/><td>patient</td><td>patient&amp;</td><td>provider&amp;</td><td>AAAAA____</td><td>AAAAA____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        PAYEE<a name=\"v3-RoleClass-PAYEE\"> </a></td><td>payee</td><td>The role of an organization or individual designated to receive payment for a claim against a particular coverage. The scoping entity is the organization that is the submitter of the invoice in question.</td><td/><td>14015</td><td>active</td><td/><td>payee</td><td>payee&amp;</td><td>invoicing&amp;</td><td>AAAAK____</td><td>AAAAK____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        PAYOR<a name=\"v3-RoleClass-PAYOR\"> </a></td><td>invoice payor</td><td>The role of an organization that undertakes to accept claims invoices, assess the coverage or payments due for those invoices and pay to the designated payees for those invoices. This role may be either the underwriter or a third-party organization authorized by the underwriter. The scoping entity is the organization that underwrites the claimed coverage.</td><td/><td>14014</td><td>active</td><td/><td>payor</td><td>invoicePayor&amp;</td><td>(underwriting&amp;)|underwriter</td><td>AAAAL____</td><td>AAAAL____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        POLHOLD<a name=\"v3-RoleClass-POLHOLD\"> </a></td><td>policy holder</td><td>A role played by a person or organization that holds an insurance policy. The underwriter of that policy is the scoping entity.\r\n\r\n*Discussion:*The identifier of the policy is captured in 'Role.id' when the Role is a policy holder.\r\n\r\nA particular policy may cover several individuals one of whom may be, but need not be, the policy holder. Thus the notion of covered party is a role that is distinct from that of the policy holder.</td><td/><td>14010</td><td>active</td><td/><td>policyHolder</td><td>policyHolder&amp;</td><td>(underwriting&amp;)|underwriter</td><td>AAAAM____</td><td>AAAAM____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        QUAL<a name=\"v3-RoleClass-QUAL\"> </a></td><td>qualified entity</td><td>An entity (player) that has been recognized as having certain training/experience or other characteristics that would make said entity an appropriate performer for a certain activity. The scoper is an organization that educates or qualifies entities.</td><td/><td>11619</td><td>active</td><td/><td>qualifiedEntity</td><td>qualified(&amp;|Entity)</td><td>qualificationGranting(&amp;|Entity)</td><td>AAAAP____</td><td>AAAAP____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        SPNSR<a name=\"v3-RoleClass-SPNSR\"> </a></td><td>coverage sponsor</td><td>A role played by an entity, usually an organization that is the sponsor of an insurance plan or a health program. A sponsor is the party that is ultimately accountable for the coverage by employment contract or by law. A sponsor can be an employer, union, government agency, or association. Fully insured sponsors establish the terms of the plan and contract with health insurance plans to assume the risk and to administer the plan. Self-insured sponsors delegate coverage administration, but not risk, to third-party administrators. Program sponsors designate services to be covered in accordance with statute. Program sponsors may administer the coverage themselves, delegate coverage administration, but not risk to third-party administrators, or contract with health insurance plans to assume the risk and administrator a program. Sponsors qualify individuals who may become\r\n\r\n1.  a policy holder of the plan;\r\n2.  where the sponsor is the policy holder, who may become a subscriber or a dependent to a policy under the plan; or\r\n3.  where the sponsor is a government agency, who may become program eligibles under a program.\r\n\r\nThe sponsor role may be further qualified by the SponsorRole.code. Entities playing the sponsor role may also play the role of a Coverage Administrator.\r\n\r\n*Example:* An employer, union, government agency, or association.</td><td/><td>14012</td><td>active</td><td/><td>sponsor</td><td>sponsor&amp;</td><td>(underwriting&amp;)|underwriter</td><td>AAAAN____</td><td>AAAAN____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        STD<a name=\"v3-RoleClass-STD\"> </a></td><td>student</td><td>A role played by an individual who is a student of a school, which is the scoping entity.</td><td/><td>12248</td><td>active</td><td/><td>student</td><td>student</td><td>school(&amp;|Entity)</td><td>AAAAQ____</td><td>AAAAQ____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        UNDWRT<a name=\"v3-RoleClass-UNDWRT\"> </a></td><td>underwriter</td><td>A role played by a person or an organization. It is the party that\r\n\r\n1.  accepts fiscal responsibility for insurance plans and the policies created under those plans;\r\n2.  administers and accepts fiscal responsibility for a program that provides coverage for services to eligible individuals; and/or\r\n3.  has the responsibility to assess the merits of each risk and decide a suitable premium for accepting all or part of the risk. If played by an organization, this role may be further specified by an appropriate RoleCode.\r\n\r\n*Example:*\r\n\r\n1.  A health insurer;\r\n2.  Medicaid Program;\r\n3.  Lloyd's of London</td><td/><td>14009</td><td>active</td><td/><td>underwriter</td><td>(underwriting&amp;)|underwriter</td><td>scoper&amp;</td><td>AAAAO____</td><td>AAAAO____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      CAREGIVER<a name=\"v3-RoleClass-CAREGIVER\"> </a></td><td>caregiver</td><td>A person responsible for the primary care of a patient at home.</td><td/><td>21355</td><td>active</td><td/><td>careGiver</td><td>careGiver&amp;</td><td>careGiverScoper</td><td>AAAC_____</td><td>AAAC_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      PRS<a name=\"v3-RoleClass-PRS\"> </a></td><td>personal relationship</td><td>Links two entities with classCode PSN (person) in a personal relationship. The character of the relationship must be defined by a PersonalRelationshipRoleType code. The player and scoper are determined by PersonalRelationshipRoleType code as well.</td><td/><td>19167</td><td>active</td><td/><td>personalRelationship</td><td>relationshipHolder</td><td>personalRelationshipWith</td><td>AAAB_____</td><td>AAAB_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      SELF<a name=\"v3-RoleClass-SELF\"> </a></td><td>self</td><td>The &quot;same&quot; roleclass asserts an identity between playing and scoping entities: that they are in fact instances of the same entity and, in the case of discrepancies (e.g different DOB, gender), that one or both are in error.\r\n\r\n*Usage:*\r\n\r\nplaying and scoping entities must have same classcode, but need not have identical attributes or values.\r\n\r\n*Example:* \r\n\r\na provider registry maintains sets of conflicting demographic data for what is reported to be the same individual.</td><td/><td>21437</td><td>retired</td><td/><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    _RoleClassPassive<a name=\"v3-RoleClass-_RoleClassPassive\"> </a></td><td>RoleClassPassive</td><td>An association for a playing Entity that is used, known, treated, handled, built, or destroyed, etc. under the auspices of the scoping Entity. The playing Entity is passive in these roles (even though it may be active in other roles), in the sense that the kinds of things done to it in this role happen without an agreement from the playing Entity.</td><td/><td>21117</td><td>active</td><td/><td>passiveRelation</td><td>playing&amp;</td><td>scoping&amp;</td><td>AAB______</td><td>AAB______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td>true</td></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ACCESS<a name=\"v3-RoleClass-ACCESS\"> </a></td><td>access</td><td>A role in which the playing entity (material) provides access to another entity. The principal use case is intravenous (or other bodily) access lines that preexist and need to be referred to for medication routing instructions.</td><td/><td>11592</td><td>active</td><td/><td>access</td><td>access&amp;</td><td>accessed&amp;</td><td>AABM_____</td><td>AABM_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ADJY<a name=\"v3-RoleClass-ADJY\"> </a></td><td>adjacency</td><td>A physical association whereby two Entities are in some (even lose) spatial relationship with each other such that they touch each other in some way.\r\n\r\n*Examples:* the colon is connected (and therefore adjacent) to the jejunum; the colon is adjacent to the liver (even if not actually connected.)\r\n\r\n*UsageConstraints:* Adjacency is in principle a symmetrical connection, but scoper and player of the role should, where applicable, be assigned to have scoper be the larger, more central Entity and player the smaller, more distant, appendage.</td><td/><td>23095</td><td>active</td><td/><td>adjacency</td><td>distal&amp;</td><td>proximal&amp;</td><td>AAB______</td><td>AAB______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        CONC<a name=\"v3-RoleClass-CONC\"> </a></td><td>connection</td><td>An adjacency of two Entities held together by a bond which attaches to each of the two entities.\r\n\r\n*Examples:* biceps brachii muscle connected to the radius bone, port 3 on a network switch connected to port 5 on a patch panel.\r\n\r\n*UsageConstraints:* See Adjacency for the assignment of scoper (larger, more central) and player (smaller, more distant).</td><td/><td>23096</td><td>active</td><td/><td>connection</td><td>distal&amp;</td><td>proximal&amp;</td><td>AAB______</td><td>AAB______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          BOND<a name=\"v3-RoleClass-BOND\"> </a></td><td>molecular bond</td><td>A connection between two atoms of a molecule.\r\n\r\n*Examples:* double bond between first and second C in ethane, peptide bond between two amino-acid, disulfide bridge between two proteins, chelate and ion associations, even the much weaker van-der-Waals bonds can be considered molecular bonds.\r\n\r\n*UsageConstraints:* See connection and adjacency for the assignment of player and scoper.</td><td/><td>23098</td><td>active</td><td/><td>bond</td><td>distal&amp;</td><td>proximal&amp;</td><td>AAB______</td><td>AAB______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          CONY<a name=\"v3-RoleClass-CONY\"> </a></td><td>continuity</td><td>A connection between two regional parts.\r\n\r\n*Examples:*  the connection between ascending aorta and the aortic arc, connection between descending colon and sigmoid.\r\n\r\n*UsageConstraints:* See connection and adjacency for the assignment of player and scoper.</td><td/><td>23097</td><td>active</td><td/><td>continuity</td><td>distal&amp;</td><td>proximal&amp;</td><td>AAB______</td><td>AAB______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ADMM<a name=\"v3-RoleClass-ADMM\"> </a></td><td>Administerable Material</td><td>A material (player) that can be administered to an Entity (scoper).</td><td/><td>21435</td><td>active</td><td/><td>administrableMaterial</td><td>administrable(&amp;|Product)</td><td>(scoping&amp;)|scoper</td><td>AABO_____</td><td>AABO_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      BIRTHPL<a name=\"v3-RoleClass-BIRTHPL\"> </a></td><td>birthplace</td><td>Relates a place (playing Entity) as the location where a living subject (scoping Entity) was born.</td><td/><td>11589</td><td>active</td><td/><td>birthplace</td><td>birthplace</td><td>birthplaceFor&amp;</td><td>AABL_____</td><td>AABL_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      DEATHPLC<a name=\"v3-RoleClass-DEATHPLC\"> </a></td><td>place of death</td><td>Definition: Relates a place (playing Entity) as the location where a living subject (scoping Entity) died.</td><td/><td>21640</td><td>active</td><td/><td>placeOfDeath</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      DST<a name=\"v3-RoleClass-DST\"> </a></td><td>distributed material</td><td>A material (player) distributed by a distributor (scoper) who functions between a manufacturer and a buyer or retailer.</td><td/><td>10418</td><td>active</td><td/><td>distributedProduct</td><td>distributed(&amp;|Product)</td><td>(distributing&amp;)|distributor</td><td>AABB_____</td><td>AABB_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        RET<a name=\"v3-RoleClass-RET\"> </a></td><td>retailed material</td><td>Material (player) sold by a retailer (scoper), who also give advice to prospective buyers.</td><td/><td>10419</td><td>active</td><td/><td>retailedProduct</td><td>retailed(&amp;|Product)</td><td>retailer&amp;</td><td>AABBA____</td><td>AABBA____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      EXLOC<a name=\"v3-RoleClass-EXLOC\"> </a></td><td>event location</td><td>A role played by a place at which the location of an event may be recorded.</td><td/><td>23368</td><td>active</td><td/><td>eventLocation</td><td>EventLocation(&amp;-PLC)</td><td/><td>AABI_____</td><td>AABI_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        SDLOC<a name=\"v3-RoleClass-SDLOC\"> </a></td><td>service delivery location</td><td>A role played by a place at which services may be provided.</td><td/><td>16927</td><td>active</td><td/><td>serviceDeliveryLocation</td><td>location(&amp;-PLC)</td><td>serviceProvider&amp;</td><td>AABJ_____</td><td>AABJ_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          DSDLOC<a name=\"v3-RoleClass-DSDLOC\"> </a></td><td>dedicated service delivery location</td><td>A role of a place (player) that is intended to house the provision of services. Scoper is the Entity (typically Organization) that provides these services. This is not synonymous with &quot;ownership.&quot;</td><td/><td>11600</td><td>active</td><td/><td>dedicatedServiceDeliveryLocation</td><td>location(&amp;-PLC)</td><td>recognizing&amp;</td><td>AABJB____</td><td>AABJB____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>6</td><td style=\"white-space:nowrap\">          ISDLOC<a name=\"v3-RoleClass-ISDLOC\"> </a></td><td>incidental service delivery location</td><td>A role played by a place at which health care services may be provided without prior designation or authorization.</td><td/><td>16929</td><td>active</td><td/><td>incidentalServiceDeliveryLocation</td><td>location(&amp;-PLC)</td><td>recognizing&amp;</td><td>AABJA____</td><td>AABJA____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      EXPR<a name=\"v3-RoleClass-EXPR\"> </a></td><td>exposed entity</td><td>A role played by an entity that has been exposed to a person or animal suffering a contagious disease, or with a location from which a toxin has been distributed. The player of the role is normally a person or animal, but it is possible that other entity types could become exposed. The role is scoped by the source of the exposure, and it is quite possible for a person playing the role of exposed party to also become the scoper a role played by another person. That is to say, once a person has become infected, it is possible, perhaps likely, for that person to infect others.\r\n\r\nManagement of exposures and tracking exposed parties is a key function within public health, and within most public health contexts - exposed parties are known as &quot;contacts.&quot;</td><td/><td>19131</td><td>active</td><td/><td>exposedEntity</td><td>exposed&amp;</td><td>exposing&amp;</td><td>AABN_____</td><td>AABN_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      HLD<a name=\"v3-RoleClass-HLD\"> </a></td><td>held entity</td><td>Entity that is currently in the possession of a holder (scoper), who holds, or uses it, usually based on some agreement with the owner.</td><td/><td>10422</td><td>active</td><td/><td>heldEntity</td><td>held(&amp;|Entity)</td><td>(holding&amp;)|holder</td><td>AABC_____</td><td>AABC_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      HLTHCHRT<a name=\"v3-RoleClass-HLTHCHRT\"> </a></td><td>health chart</td><td>The role of a material (player) that is the physical health chart belonging to an organization (scoper).</td><td/><td>11618</td><td>active</td><td/><td>healthChart</td><td>healthChart&amp;</td><td>subject&amp;</td><td>AABI_____</td><td>AABI_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      IDENT<a name=\"v3-RoleClass-IDENT\"> </a></td><td>identified entity</td><td>A role in which the scoping entity designates an identifier for a playing entity.</td><td/><td>16721</td><td>active</td><td/><td>identifiedEntity</td><td>identified(&amp;|Entity)</td><td>assigning(&amp;|Authority)</td><td>AABA_____</td><td>AABA_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      MANU<a name=\"v3-RoleClass-MANU\"> </a></td><td>manufactured product</td><td>Scoped by the manufacturer</td><td/><td>11580</td><td>active</td><td/><td>manufacturedProduct</td><td>manufactured(&amp;|Product)</td><td>manufacturer&amp;</td><td>AABD_____</td><td>AABD_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        THER<a name=\"v3-RoleClass-THER\"> </a></td><td>therapeutic agent</td><td>A manufactured material (player) that is used for its therapeutic properties. The manufacturer is the scoper.</td><td/><td>11581</td><td>active</td><td/><td>manufacturedProduct</td><td>manufactured(&amp;|Product)</td><td>manufacturer&amp;</td><td>AABDA____</td><td>AABDA____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      MNT<a name=\"v3-RoleClass-MNT\"> </a></td><td>maintained entity</td><td>An entity (player) that is maintained by another entity (scoper). This is typical role held by durable equipment. The scoper assumes responsibility for proper operation, quality, and safety.</td><td/><td>10427</td><td>active</td><td/><td>maintainedEntity</td><td>maintained(&amp;|Entity)</td><td>(maintaining&amp;)|maintainer</td><td>AABE_____</td><td>AABE_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      OWN<a name=\"v3-RoleClass-OWN\"> </a></td><td>owned entity</td><td>An Entity (player) for which someone (scoper) is granted by law the right to call the material (player) his own. This entitles the scoper to make decisions about the disposition of that material.</td><td/><td>10421</td><td>active</td><td/><td>ownedEntity</td><td>owned(&amp;|Entity)</td><td>(owning&amp;)|owner</td><td>AABF_____</td><td>AABF_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      RGPR<a name=\"v3-RoleClass-RGPR\"> </a></td><td>regulated product</td><td>A product regulated by some governmentatl orgnization. The role is played by Material and scoped by Organization.\r\n\r\nRationale: To support an entity clone used to identify the NDC number for a drug product.</td><td/><td>19132</td><td>active</td><td/><td>regulatedProduct</td><td>regulated(&amp;|Product)</td><td>regulator&amp;</td><td>AABH_____</td><td>AABH_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      TERR<a name=\"v3-RoleClass-TERR\"> </a></td><td>territory of authority</td><td>Relates a place entity (player) as the region over which the scoper (typically an Organization) has certain authority (jurisdiction). For example, the Calgary Regional Health Authority (scoper) has authority over the territory &quot;Region 4 of Alberta&quot; (player) in matters of health.</td><td/><td>11583</td><td>active</td><td/><td>territorialAuthority</td><td>territory(&amp;-PLC)</td><td>governing&amp;</td><td>AABK_____</td><td>AABK_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      USED<a name=\"v3-RoleClass-USED\"> </a></td><td>used entity</td><td>**Description:**An entity (player) that is used by another entity (scoper)</td><td/><td>22755</td><td>active</td><td/><td>usedEntity</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      WRTE<a name=\"v3-RoleClass-WRTE\"> </a></td><td>warranted product</td><td>A role a product plays when a guarantee is given to the purchaser by the seller (scoping entity) stating that the product is reliable and free from known defects and that the seller will repair or replace defective parts within a given time limit and under certain conditions.</td><td/><td>16300</td><td>active</td><td/><td>warrantedProduct</td><td>warranted(&amp;|Product)</td><td>(warranting&amp;)|warranter</td><td>AABG_____</td><td>AABG_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>2</td><td style=\"white-space:nowrap\">  _RoleClassOntological<a name=\"v3-RoleClass-_RoleClassOntological\"> </a></td><td>RoleClassOntological</td><td>A relationship in which the scoping Entity defines or specifies what the playing Entity is. Thus, the player's &quot;being&quot; (Greek: ontos) is specified.</td><td/><td>21115</td><td>active</td><td/><td>definedEntity</td><td>defined&amp;</td><td>defining&amp;</td><td>AC_______</td><td>AC_______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td>true</td></tr><tr><td>3</td><td style=\"white-space:nowrap\">    EQUIV<a name=\"v3-RoleClass-EQUIV\"> </a></td><td>equivalent entity</td><td>**Description:** Specifies the player Entity (the equivalent Entity) as an Entity that is considered to be equivalent to a reference Entity (scoper). The equivalence is in principle a symmetric relationship, however, it is expected that the scoper is a reference entity which serves as reference entity for multiple different equivalent entities.\r\n\r\n**Examples:** An innovator's medicine formulation is the reference for &quot;generics&quot;, i.e., formulations manufactured differently but having been proven to be biologically equivalent to the reference medicine. Another example is a reference ingredient that serves as basis for quantity specifications (basis of strength, e.g., metoprolol succinate specified in terms of metoprolol tartrate.)</td><td/><td>22399</td><td>active</td><td/><td>equivalentEntity</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      SAME<a name=\"v3-RoleClass-SAME\"> </a></td><td>same</td><td>The &quot;same&quot; role asserts an identity between playing and scoping entities, i.e., that they are in fact two records of the same entity instance, and, in the case of discrepancies (e.g different DOB, gender), that one or both are in error.\r\n\r\n*Usage:*\r\n\r\nplaying and scoping entities must have same classCode, but need not have identical attributes or values.\r\n\r\n*Example:* \r\n\r\na provider registry maintains sets of conflicting demographic data for what is reported to be the same individual.</td><td/><td>21488</td><td>active</td><td/><td>same</td><td>same&amp;</td><td>same&amp;</td><td>ACE______</td><td>ACE______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      SUBY<a name=\"v3-RoleClass-SUBY\"> </a></td><td>subsumed by</td><td>Relates a prevailing record of an Entity (scoper) with another record (player) that it subsumes.\r\n\r\n*Examples:* Show a correct new Person object (scoper) that subsumes one or more duplicate Person objects that had accidentally been created for the same physical person.\r\n\r\n*Constraints:* Both the player and scoper must have the same classCode.</td><td/><td>20070</td><td>active</td><td/><td>subsumedBy</td><td>subsuming&amp;</td><td>subsumed&amp;</td><td>ACD______</td><td>ACD______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    GEN<a name=\"v3-RoleClass-GEN\"> </a></td><td>has generalization</td><td>Relates a specialized material concept (player) to its generalization (scoper).</td><td/><td>10441</td><td>active</td><td/><td>specializedKind</td><td>specialized(&amp;|Kind)</td><td>generalized(&amp;|Kind)</td><td>ACA______</td><td>ACA______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      GRIC<a name=\"v3-RoleClass-GRIC\"> </a></td><td>has generic</td><td>A special link between pharmaceuticals indicating that the target (scoper) is a generic for the source (player).</td><td/><td>10442</td><td>active</td><td/><td>entityWithGeneric</td><td>specialized(&amp;|Kind)</td><td>generic(&amp;|Kind)</td><td>ACAA_____</td><td>ACAA_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    INST<a name=\"v3-RoleClass-INST\"> </a></td><td>instance</td><td>An individual piece of material (player) instantiating a class of material (scoper).</td><td/><td>10443</td><td>active</td><td/><td>instanceOfKind</td><td>&amp;Instance</td><td>kindOf&amp;</td><td>ACB______</td><td>ACB______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    SUBS<a name=\"v3-RoleClass-SUBS\"> </a></td><td>subsumer</td><td>An entity that subsumes the identity of another. Used in the context of merging documented entity instances. Both the player and scoper must have the same classCode.\r\n\r\nThe use of this code is **deprecated** in favor of the term SUBY which is its inverse and is more ontologically correct.</td><td>Deprecated</td><td>16241</td><td>deprecated</td><td>2011-12-01</td><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>2</td><td style=\"white-space:nowrap\">  _RoleClassPartitive<a name=\"v3-RoleClass-_RoleClassPartitive\"> </a></td><td>RoleClassPartitive</td><td>An association between two Entities where the playing Entity is considered in some way &quot;part&quot; of the scoping Entity, e.g., as a member, component, ingredient, or content. Being &quot;part&quot; in the broadest sense of the word can mean anything from being an integral structural component to a mere incidental temporary association of a playing Entity with a (generally larger) scoping Entity.</td><td/><td>21116</td><td>active</td><td/><td>partOfWhole</td><td>part&amp;</td><td>whole&amp;</td><td>AB_______</td><td>AB_______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td>true</td></tr><tr><td>3</td><td style=\"white-space:nowrap\">    CONT<a name=\"v3-RoleClass-CONT\"> </a></td><td>content</td><td>Relates a material as the content (player) to a container (scoper). Unlike ingredients, the content and a container remain separate (not mixed) and the content can be removed from the container. A content is not part of an empty container.</td><td/><td>10438</td><td>active</td><td/><td>content</td><td>(contained(&amp;-MAT))|content</td><td>container&amp;</td><td>ABB______</td><td>ABB______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    EXPAGTCAR<a name=\"v3-RoleClass-EXPAGTCAR\"> </a></td><td>exposure agent carrier</td><td>An exposure agent carrier is an entity that is capable of conveying an exposure agent from one entity to another. The scoper of the role must be the exposure agent (e.g., pathogen).</td><td/><td>22350</td><td>active</td><td/><td>exposureAgentCarrier</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      EXPVECTOR<a name=\"v3-RoleClass-EXPVECTOR\"> </a></td><td>exposure vector</td><td>**Description:** A vector is a living subject that carries an exposure agent. The vector does not cause the disease itself, but exposes targets to the exposure agent. A mosquito carrying malaria is an example of a vector. The scoper of the role must be the exposure agent (e.g., pathogen).</td><td/><td>22351</td><td>active</td><td/><td>exposureVector</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      FOMITE<a name=\"v3-RoleClass-FOMITE\"> </a></td><td>fomite</td><td>**Description:** A fomite is a non-living entity that is capable of conveying exposure agent from one entity to another. A doorknob contaminated with a Norovirus is an example of a fomite. Anyone touching the doorknob would be exposed to the virus. The scoper of the role must be the exposure agent (e.g., pathogen).</td><td/><td>22352</td><td>active</td><td/><td>fomite</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    INGR<a name=\"v3-RoleClass-INGR\"> </a></td><td>ingredient</td><td>Relates a component (player) to a mixture (scoper). E.g., Glucose and Water are ingredients of D5W, latex may be an ingredient in a tracheal tube.</td><td/><td>10430</td><td>active</td><td/><td>ingredient</td><td>ingredient&amp;</td><td>ingredientOf&amp;</td><td>ABD______</td><td>ABD______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ACTI<a name=\"v3-RoleClass-ACTI\"> </a></td><td>active ingredient</td><td>**Definition:** a therapeutically active ingredient (player) in a mixture (scoper), where the mixture is typically a manufactured pharmaceutical. It is unknown if the quantity of such an ingredient is expressed precisely in terms of the playing ingredient substance, or, if it is specified in terms of a closely related substance (active moiety or reference substance).</td><td/><td>10433</td><td>active</td><td/><td>activeIngredient</td><td>activeIngredient&amp;</td><td>ingredientOf&amp;</td><td>ABDA_____</td><td>ABDA_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        ACTIB<a name=\"v3-RoleClass-ACTIB\"> </a></td><td>active ingredient - basis of strength</td><td>**Description:**  Active ingredient, where the ingredient substance (player) is itself the &quot;basis of strength&quot;, i.e., where the Role.quantity specifies exactly the quantity of the player substance in the medicine formulation.\r\n\r\n**Examples:** Lopressor 50 mg actually contains 50 mg of metoprolol succinate, even though the active moiety is metoprolol, but also: Tenormin 50 mg contain 50 mg of atenolol, as free base, i.e., where the active ingredient atenolol is also the active moiety.</td><td/><td>22396</td><td>active</td><td/><td>activeIngredientBasisOfStrength</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        ACTIM<a name=\"v3-RoleClass-ACTIM\"> </a></td><td>active ingredient - moiety is basis of strength</td><td>**Description:** Active ingredient, where not the ingredient substance (player), but itaTMs active moiety is the &quot;basis of strength&quot;, i.e., where the Role.quantity specifies the quantity of the player substance's active moiety in the medicine formulation.\r\n\r\n**Examples:** 1 mL of Betopic 5mg/mL eye drops contains 5.6 mg betaxolol hydrochloride equivalent to betaxolol base 5 mg.</td><td/><td>22397</td><td>active</td><td/><td>activeIngredientMoietyIsBasisOfStrength</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        ACTIR<a name=\"v3-RoleClass-ACTIR\"> </a></td><td>active ingredient - reference substance is basis of strength</td><td>**Description:** Active ingredient, where not the ingredient substance (player) but another reference substance with the same active moiety, is the &quot;basis of strength&quot;, i.e., where the Role.quantity specifies the quantity of a reference substance, similar but different from the player substance's in the medicine formulation.\r\n\r\n**Examples:** Toprol-XL 50 mg contains 47.5 mg of metoprolol succinate equivalent to 50 mg of metoprolol tartrate.</td><td/><td>22398</td><td>active</td><td/><td>activeIngredientReferenceSubstanceIsBasisOfStrength</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ADJV<a name=\"v3-RoleClass-ADJV\"> </a></td><td>adjuvant</td><td>A component (player) added to enhance the action of an active ingredient (scoper) (in the manner of a catalyst) but which has no active effect in and of itself. Such ingredients are significant in defining equivalence of products in a way that inactive ingredients are not.</td><td/><td>23059</td><td>active</td><td/><td>adjuvant</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ADTV<a name=\"v3-RoleClass-ADTV\"> </a></td><td>additive</td><td>An ingredient (player) that is added to a base (scoper), that amounts to a minor part of the overall mixture.</td><td/><td>10432</td><td>active</td><td/><td>additive</td><td>additive&amp;</td><td>additiveOf&amp;</td><td>ABDE_____</td><td>ABDE_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      BASE<a name=\"v3-RoleClass-BASE\"> </a></td><td>base</td><td>A base ingredient (player) is what comprises the major part of a mixture (scoper). E.g., Water in most i.v. solutions, or Vaseline in salves. Among all ingredients of a material, there should be only one base. A base substance can, in turn, be a mixture.</td><td/><td>10431</td><td>active</td><td/><td>base</td><td>base&amp;</td><td>baseOf&amp;</td><td>ABDC_____</td><td>ABDC_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      CNTM<a name=\"v3-RoleClass-CNTM\"> </a></td><td>contaminant ingredient</td><td>An ingredient whose presence is not intended but may not be reasonably avoided given the circumstances of the mixture's nature or origin.</td><td/><td>23369</td><td>active</td><td/><td>contaminant</td><td>contaminant&amp;</td><td/><td>ABDF_____</td><td>ABDF_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      IACT<a name=\"v3-RoleClass-IACT\"> </a></td><td>inactive ingredient</td><td>An ingredient which is not considered therapeutically active, e.g., colors, flavors, stabilizers, or preservatives, fillers, or structural components added to an active ingredient in order to facilitate administration of the active ingredient but without being considered therapeutically active. An inactive ingredient need not be biologically inert, e.g., might be active as an allergen or might have a pleasant taste, but is not an essential constituent delivering the therapeutic effect.</td><td/><td>19089</td><td>active</td><td/><td>inactiveIngredient</td><td>inactiveIngredient&amp;</td><td>ingredientOf&amp;</td><td>ABDD_____</td><td>ABDD_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        COLR<a name=\"v3-RoleClass-COLR\"> </a></td><td>color additive</td><td>A substance (player) influencing the optical aspect of material (scoper).</td><td/><td>10437</td><td>active</td><td/><td>colorAdditive</td><td>color&amp;</td><td>additiveOf&amp;</td><td>ABDDC____</td><td>ABDDC____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        FLVR<a name=\"v3-RoleClass-FLVR\"> </a></td><td>flavor additive</td><td>A substance (player) added to a mixture (scoper) to make it taste a certain way. In food the use is obvious, in pharmaceuticals flavors can hide disgusting taste of the active ingredient (important in pediatric treatments).</td><td/><td>10436</td><td>active</td><td/><td>flavorAdditive</td><td>flavor&amp;</td><td>additiveOf&amp;</td><td>ABDDD____</td><td>ABDDD____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        PRSV<a name=\"v3-RoleClass-PRSV\"> </a></td><td>preservative</td><td>A substance (player) added to a mixture (scoper) to prevent microorganisms (fungi, bacteria) to spoil the mixture.</td><td/><td>10435</td><td>active</td><td/><td>preservative</td><td>preservative&amp;</td><td>preservativeOf&amp;</td><td>ABDDA____</td><td>ABDDA____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>5</td><td style=\"white-space:nowrap\">        STBL<a name=\"v3-RoleClass-STBL\"> </a></td><td>stabilizer</td><td>A stabilizer (player) added to a mixture (scoper) in order to prevent the molecular disintegration of the main substance.</td><td/><td>10434</td><td>active</td><td/><td>stabilizer</td><td>stabilizer&amp;</td><td>stabilizerOf&amp;</td><td>ABDDB____</td><td>ABDDB____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      MECH<a name=\"v3-RoleClass-MECH\"> </a></td><td>mechanical ingredient</td><td>An ingredient (player) of a medication (scoper) that is inseparable from the active ingredients, but has no intended chemical or pharmaceutical effect itself, but which may have some systemic effect on the patient.\r\n\r\nAn example is a collagen matrix used as a base for transplanting skin cells. The collagen matrix can be left permanently in the graft site. Because it is of bovine origin, the patient may exhibit allergies or may have cultural objections to its use.</td><td/><td>23060</td><td>active</td><td/><td>mechanicalIngredient</td><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    LOCE<a name=\"v3-RoleClass-LOCE\"> </a></td><td>located entity</td><td>Relates an entity (player) to a location (scoper) at which it is present in some way. This presence may be limited in time.</td><td/><td>16815</td><td>active</td><td/><td>locatedEntity</td><td>located(&amp;|Entity)</td><td>location(&amp;-PLC)</td><td>ABE______</td><td>ABE______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      STOR<a name=\"v3-RoleClass-STOR\"> </a></td><td>stored entity</td><td>Relates an entity (player) (e.g. a device) to a location (scoper) at which it is normally found or stored when not used.</td><td/><td>16817</td><td>active</td><td/><td>storedEntity</td><td>stored(&amp;|Entity)</td><td>storageLocation(&amp;-PLC)</td><td>ABEA_____</td><td>ABEA_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    MBR<a name=\"v3-RoleClass-MBR\"> </a></td><td>member</td><td>A role played by an entity that is a member of a group. The group provides the scope for this role.\r\n\r\nAmong other uses, groups as used in insurance (groups of covered individuals) and in scheduling where resources may be grouped for scheduling and logistical purposes.</td><td/><td>12204</td><td>active</td><td/><td>member</td><td>member&amp;</td><td>group&amp;</td><td>ABF______</td><td>ABF______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    PART<a name=\"v3-RoleClass-PART\"> </a></td><td>part</td><td>**Definition:**  an association between two Entities where the playing Entity (the part) is a component of the whole (scoper) in the sense of an integral structural component, that is distinct from other parts in the same whole, has a distinct function in the whole, and, as an effect, the full integrity of the whole depends (to some degree) on the presence of this part, even though the part may often be separable from the whole.\r\n\r\n**Discussion:** Part is defined in opposition to (a) ingredient (not separable), (b) content (not a functional component), and (c) member (not functionally distinct from other members).</td><td/><td>19102</td><td>active</td><td/><td>partOfWhole</td><td>part&amp;</td><td>whole&amp;</td><td>ABC______</td><td>ABC______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ACTM<a name=\"v3-RoleClass-ACTM\"> </a></td><td>active moiety</td><td>The molecule or ion that is responsible for the intended pharmacological action of the drug substance, excluding those appended or associated parts of the molecule that make the molecule an ester, salt (including a salt with hydrogen or coordination bonds), or other noncovalent derivative (such as a complex, chelate, or clathrate).\r\n\r\nExamples: heparin-sodium and heparin-potassium have the same active moiety, heparin; the active moiety of morphine-hydrochloride is morphine.</td><td/><td>19088</td><td>active</td><td/><td>activeMoiety</td><td>activeMoiety</td><td>moietyOf&amp;</td><td>ABDB_____</td><td>ABDB_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>3</td><td style=\"white-space:nowrap\">    SPEC<a name=\"v3-RoleClass-SPEC\"> </a></td><td>specimen</td><td>A role played by a material entity that is a specimen for an act. It is scoped by the source of the specimen.</td><td/><td>11591</td><td>active</td><td/><td>specimen</td><td>specimen&amp;</td><td>source&amp;</td><td>ABA______</td><td>ABA______</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ALQT<a name=\"v3-RoleClass-ALQT\"> </a></td><td>aliquot</td><td>A portion (player) of an original or source specimen (scoper) used for testing or transportation.</td><td/><td>14026</td><td>active</td><td/><td>aliquot</td><td>aliquot&amp;</td><td>source&amp;</td><td>ABAA_____</td><td>ABAA_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>4</td><td style=\"white-space:nowrap\">      ISLT<a name=\"v3-RoleClass-ISLT\"> </a></td><td>isolate</td><td>A microorganism that has been isolated from other microorganisms or a source matrix.</td><td/><td>16302</td><td>active</td><td/><td>isolate</td><td>isolate&amp;</td><td>source&amp;</td><td>ABAB_____</td><td>ABAB_____</td><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>1</td><td style=\"white-space:nowrap\">CHILD<a name=\"v3-RoleClass-CHILD\"> </a></td><td>child</td><td>The player of the role is a child of the scoping entity, in a generic sense.</td><td/><td>11560</td><td>retired</td><td/><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>1</td><td style=\"white-space:nowrap\">CRED<a name=\"v3-RoleClass-CRED\"> </a></td><td>credentialed entity</td><td>A role played by an entity that receives credentials from the scoping entity.</td><td/><td>16930</td><td>retired</td><td/><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>1</td><td style=\"white-space:nowrap\">NURPRAC<a name=\"v3-RoleClass-NURPRAC\"> </a></td><td>nurse practitioner</td><td/><td/><td>11574</td><td>retired</td><td/><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>1</td><td style=\"white-space:nowrap\">NURS<a name=\"v3-RoleClass-NURS\"> </a></td><td>nurse</td><td/><td/><td>11573</td><td>retired</td><td/><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>1</td><td style=\"white-space:nowrap\">PA<a name=\"v3-RoleClass-PA\"> </a></td><td>physician assistant</td><td/><td/><td>11575</td><td>retired</td><td/><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr><tr><td>1</td><td style=\"white-space:nowrap\">PHYS<a name=\"v3-RoleClass-PHYS\"> </a></td><td>physician</td><td/><td/><td>11572</td><td>retired</td><td/><td/><td/><td/><td/><td/><td>as&amp;</td><td>&amp;</td><td>&amp;</td><td/></tr></table></div>"},"url":"http://terminology.hl7.org/CodeSystem/v3-RoleClass","identifier":[{"system":"urn:ietf:rfc:3986","value":"urn:oid:2.16.840.1.113883.5.110"}],"version":"3.1.0","name":"RoleClass","title":"RoleClass","status":"active","date":"2019-03-20","publisher":"Health Level 7","contact":[{"name":"Health Level Seven"}],"description":"Codes for the Role class hierarchy. The values in this hierarchy, represent a Role which is an association or relationship between two entities - the entity that plays the role and the entity that scopes the role. Roles names are derived from the name of the playing entity in that role.\r\n\r\nThe role hierarchy stems from three core concepts, or abstract domains:\r\n\r\n *  **RoleClassOntological** is an abstract domain that collects roles in which the playing entity is defined or specified by the scoping entity.\r\n *  **RoleClassPartitive** collects roles in which the playing entity is in some sense a \"part\" of the scoping entity.\r\n *  **RoleClassAssociative** collects all of the remaining forms of association between the playing entity and the scoping entity. This set of roles is further partitioned between:\r\n    \r\n     *  **RoleClassPassive** which are roles in which the playing entity is used, known, treated, handled, built, or destroyed, etc. under the auspices of the scoping entity. The playing entity is passive in these roles in that the role exists without an agreement from the playing entity.\r\n     *  **RoleClassMutualRelationship** which are relationships based on mutual behavior of the two entities. The basis of these relationship may be formal agreements or they may be *de facto* behavior. Thus, this sub-domain is further divided into:\r\n        \r\n         *  **RoleClassRelationshipFormal** in which the relationship is formally defined, frequently by a contract or agreement.\r\n         *  **Personal relationship** which inks two people in a personal relationship.\r\n\r\nThe hierarchy discussed above is represented In the current vocabulary tables as a set of abstract domains, with the exception of the \"Personal relationship\" which is a leaf concept.\r\n\r\n*OpenIssue:* Description copied from Concept Domain of same name. Must be verified.","caseSensitive":true,"hierarchyMeaning":"is-a","content":"complete","property":[{"extension":[{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-symmetry","valueCode":"antisymmetric"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-transitivity","valueCode":"transitive"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-reflexivity","valueCode":"irreflexive"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-isNavigable","valueBoolean":true},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-relationshipKind","valueCode":"Specializes"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-inverseName","valueString":"Generalizes"}],"code":"Specializes","description":"The child code is a more narrow version of the concept represented by the parent code.  I.e. Every child concept is also a valid parent concept.  Used to allow determination of subsumption.  Must be transitive, irreflexive, antisymmetric.","type":"Coding"},{"extension":[{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-symmetry","valueCode":"antisymmetric"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-transitivity","valueCode":"transitive"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-reflexivity","valueCode":"irreflexive"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-isNavigable","valueBoolean":true},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-relationshipKind","valueCode":"Generalizes"},{"url":"http://terminology.hl7.org/StructureDefinition/ext-mif-relationship-inverseName","valueString":"Specializes"}],"code":"Generalizes","description":"Inverse of Specializes.  Only included as a derived relationship.","type":"Coding"},{"code":"internalId","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#v3-internal-id","description":"The internal identifier for the concept in the HL7 Access database repository.","type":"code"},{"code":"status","uri":"http://hl7.org/fhir/concept-properties#status","description":"A property that indicates the status of the concept. One of active, experimental, deprecated, or retired.","type":"code"},{"code":"deprecationDate","uri":"http://hl7.org/fhir/concept-properties#deprecationDate","description":"The date at which a concept was deprecated. Concepts that are deprecated but not inactive can still be used, but their use is discouraged.","type":"dateTime"},{"code":"Name:Class","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Class","description":"The formal name for the class clone under this code","type":"code"},{"code":"Name:Role:player:Entity","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Role-player","description":"The name of the relationship from Role to the payer Entity","type":"code"},{"code":"Name:Role:scoper:Entity","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Role-scoper","description":"The name of the relationship from Role to the scoper Entity","type":"code"},{"code":"Sort:Entity:playedRole:Role","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-played-sort","description":"Sort key for the relationship from the Entity to the playedRole","type":"code"},{"code":"Sort:Entity:scopedRole:Role","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-scoped-sort","description":"The sort key for the relationship from the Entity to the scopedRole","type":"code"},{"code":"Name:Entity:playedRole:Role","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-played","description":"The name of the relationship from the Entity to the playedRole","type":"string"},{"code":"Name:Entity:scopedRole:Role","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Entity-scoped","description":"The name of the relationship from the Entity to the scopedRole","type":"string"},{"code":"Name:Participation:role:Role","uri":"http://terminology.hl7.org/CodeSystem/utg-concept-properties#rim-Participation-role","description":"The name of the relationship from Participation to Role","type":"string"},{"code":"notSelectable","uri":"http://hl7.org/fhir/concept-properties#notSelectable","description":"Indicates that the code is abstract - only intended to be used as a selector for other concepts","type":"boolean"}],"concept":[{"code":"ROL","display":"role","definition":"Corresponds to the Role class","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"13940"},{"code":"Name:Class","valueCode":"role"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"},{"code":"Name:Role:player:Entity","valueCode":"(playing&)|player"},{"code":"Name:Role:scoper:Entity","valueCode":"(scoping&)|scoper"},{"code":"Sort:Entity:playedRole:Role","valueCode":"A________"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"A________"}],"concept":[{"code":"_RoleClassAssociative","display":"RoleClassAssociative","definition":"A general association between two entities that is neither partitive nor ontological.","property":[{"code":"notSelectable","valueBoolean":true},{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21113"},{"code":"Name:Class","valueCode":"associatedEntity"},{"code":"Name:Role:player:Entity","valueCode":"associated&"},{"code":"Name:Role:scoper:Entity","valueCode":"scoping&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AA_______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AA_______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"_RoleClassMutualRelationship","display":"RoleClassMutualRelationship","definition":"A relationship that is based on mutual behavior of the two Entities as being related. The basis of such relationship may be agreements (e.g., spouses, contract parties) or they may be *de facto* behavior (e.g. friends) or may be an incidental involvement with each other (e.g. parties over a dispute, siblings, children).","property":[{"code":"notSelectable","valueBoolean":true},{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21114"},{"code":"Name:Class","valueCode":"relatedEntity"},{"code":"Name:Role:player:Entity","valueCode":"related&"},{"code":"Name:Role:scoper:Entity","valueCode":"scoping&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAA______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAA______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"_RoleClassRelationshipFormal","display":"RoleClassRelationshipFormal","definition":"A relationship between two entities that is formally recognized, frequently by a contract or similar agreement.","property":[{"code":"notSelectable","valueBoolean":true},{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21118"},{"code":"Name:Class","valueCode":"formalRelation"},{"code":"Name:Role:player:Entity","valueCode":"related&"},{"code":"Name:Role:scoper:Entity","valueCode":"related&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAA_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAA_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"AFFL","display":"affiliate","definition":"Player of the Affiliate role has a business/professional relationship with scoper. Player and scoper may be persons or organization. The Affiliate relationship does not imply membership in a group, nor does it exist for resource scheduling purposes.\r\n\r\n*Example:* A healthcare provider is affiliated with another provider as a business associate.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21438"},{"code":"Name:Class","valueCode":"affiliate"},{"code":"Name:Role:player:Entity","valueCode":"affiliate&"},{"code":"Name:Role:scoper:Entity","valueCode":"affiliated&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAR____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAR____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"AGNT","display":"agent","definition":"An entity (player) that acts or is authorized to act on behalf of another entity (scoper).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14006"},{"code":"Name:Class","valueCode":"agent"},{"code":"Name:Role:player:Entity","valueCode":"agent&"},{"code":"Name:Role:scoper:Entity","valueCode":"(represented&)|representee"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAD____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAD____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"ASSIGNED","display":"assigned entity","definition":"An agent role in which the agent is an Entity acting in the employ of an organization. The focus is on functional role on behalf of the organization, unlike the Employee role where the focus is on the 'Human Resources' relationship between the employee and the organization.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11595"},{"code":"Name:Class","valueCode":"assignedEntity"},{"code":"Name:Role:player:Entity","valueCode":"(assigned&)|assignee"},{"code":"Name:Role:scoper:Entity","valueCode":"(represented&)|representee"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAADA___"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAADA___"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"COMPAR","display":"commissioning party","definition":"An Entity that is authorized to issue or instantiate permissions, privileges, credentials or other formal/legal authorizations.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21303"},{"code":"Name:Class","valueCode":"commissioningParty"},{"code":"Name:Role:player:Entity","valueCode":"commissioning&"},{"code":"Name:Role:scoper:Entity","valueCode":"commissioningScoper"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAADAC__"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAADAC__"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"SGNOFF","display":"signing authority or officer","definition":"The role of a person (player) who is the officer or signature authority for of a scoping entity, usually an organization (scoper).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14007"},{"code":"Name:Class","valueCode":"signatureAuthority"},{"code":"Name:Role:player:Entity","valueCode":"signing(&|Authority)"},{"code":"Name:Role:scoper:Entity","valueCode":"(represented&)|representee"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAADAB__"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAADAB__"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"CON","display":"contact","definition":"A person or an organization (player) which provides or receives information regarding another entity (scoper). Examples; patient NOK and emergency contacts; guarantor contact; employer contact.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"12205"},{"code":"Name:Class","valueCode":"contactParty"},{"code":"Name:Role:player:Entity","valueCode":"contact(&|Party)"},{"code":"Name:Role:scoper:Entity","valueCode":"(represented&)|representee"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAADAA__"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAADAA__"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"ECON","display":"emergency contact","definition":"An entity to be contacted in the event of an emergency.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19140"},{"code":"Name:Class","valueCode":"emergencyContact"},{"code":"Name:Role:player:Entity","valueCode":"emergencyContact(&|Party)"},{"code":"Name:Role:scoper:Entity","valueCode":"(represented&)|representee"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAADAAB_"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAADAAB_"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"NOK","display":"next of kin","definition":"An individual designated for notification as the next of kin for a given entity.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19141"},{"code":"Name:Class","valueCode":"nextOfKin"},{"code":"Name:Role:player:Entity","valueCode":"nextOfKinContact&"},{"code":"Name:Role:scoper:Entity","valueCode":"(represented&)|representee"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAADAAA_"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAADAAA_"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"GUARD","display":"guardian","definition":"Guardian of a ward","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16324"},{"code":"Name:Class","valueCode":"guardian"},{"code":"Name:Role:player:Entity","valueCode":"guardian&"},{"code":"Name:Role:scoper:Entity","valueCode":"ward&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAADB___"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAADB___"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"CIT","display":"citizen","definition":"Citizen of apolitical entity","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11568"},{"code":"Name:Class","valueCode":"citizen"},{"code":"Name:Role:player:Entity","valueCode":"citizen&"},{"code":"Name:Role:scoper:Entity","valueCode":"political(&|Entity)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAF____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAF____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"COVPTY","display":"covered party","definition":"A role class played by a person who receives benefit coverage under the terms of a particular insurance policy. The underwriter of that policy is the scoping entity. The covered party receives coverage because of some contractual or other relationship with the holder of that policy.\r\n\r\n*Discussion:*This reason for coverage is captured in 'Role.code' and a relationship link with type code of indirect authority should be included using the policy holder role as the source, and the covered party role as the target.\r\n\r\nNote that a particular policy may cover several individuals one of whom may be, but need not be, the policy holder. Thus the notion of covered party is a role that is distinct from that of the policy holder.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14011"},{"code":"Name:Class","valueCode":"coveredParty"},{"code":"Name:Role:player:Entity","valueCode":"covered(&|Party)"},{"code":"Name:Role:scoper:Entity","valueCode":"(underwriting&)|underwriter"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAI____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAI____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"CLAIM","display":"claimant","definition":"**Description:** A role played by a party making a claim for coverage under a policy or program. A claimant must be either a person or organization, or a group of persons or organizations. A claimant is not a named insured or a program eligible.\r\n\r\n**Discussion:** With respect to liability insurance such as property and casualty insurance, a claimant must file a claim requesting indemnification for a loss that the claimant considers covered under the policy of a named insured. The claims adjuster for the policy underwriter will review the claim to determine whether the loss meets the benefit coverage criteria under a policy, and base any indemnification or coverage payment on that review. If a third party is liable in whole or part for the loss, the underwriter may pursue third party liability recovery. A claimant may be involved in civil or criminal legal proceedings involving claims against a defendant party that is indemnified by an insurance policy or to protest the finding of a claims adjustor. With respect to life insurance, a beneficiary designated by a named insured becomes a claimant of the proceeds of coverage, as in the case of a life insurance policy. However, a claimant for coverage under life insurance is not necessarily a designated beneficiary.\r\n\r\n**Note:** A claimant is not a named insured. However, a named insured may make a claim under a policy, e.g., an insured driver may make a claim for an injury under his or her comprehensive automobile insurance policy. Similarly, a program eligible may make a claim under program, e.g., an unemployed worker may claim benefits under an unemployment insurance program, but parties playing these covered party role classes are not, for purposes of this vocabulary and in an effort to clearly distinguish role classes, considered claimants.\r\n\r\nIn the case of a named insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that either a named insured or an individual insured has filed a claim for a loss. In the case of a program eligible, a role type code INJWKR (injured worker) subtypes the class to indicate that the covered party in a workers compensation program is an injured worker, and as such, has filed a \"claim\" under the program for benefits. Likewise, a covered role type code UNEMP (unemployed worker) subtypes the program eligible class to indicate that the covered party in an unemployment insurance program has filed a claim for unemployment benefits.\r\n\r\n**Example:** A claimant under automobile policy that is not the named insured.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21955"},{"code":"Name:Class","valueCode":"claimant"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"NAMED","display":"named insured","definition":"**Description:** A role played by a party to an insurance policy to which the insurer agrees to indemnify for losses, provides benefits for, or renders services. A named insured may be either a person, non-person living subject, or an organization, or a group of persons, non-person living subjects, or organizations.\r\n\r\n**Discussion:** The coded concept NAMED should not be used where a more specific child concept in this Specializable value set applies. In some cases, the named insured may not be the policy holder, e.g., where a policy holder purchases life insurance policy in which another party is the named insured and the policy holder is the beneficiary of the policy.\r\n\r\n**Note:** The party playing the role of a named insured is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a named insured may make a claim under a policy, e.g., e.g., a party that is the named insured and policy holder under a comprehensive automobile insurance policy may become the claimant for coverage under that policy e.g., if injured in an automobile accident and there is no liable third party. In the case of a named insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that a named insured has filed a claim for a loss.\r\n\r\n**Example:** The named insured under a comprehensive automobile, disability, or property and casualty policy that is the named insured and may or may not be the policy holder.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21957"},{"code":"Name:Class","valueCode":"namedInsured"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"DEPEN","display":"dependent","definition":"**Description:** A role played by a person covered under a policy or program based on an association with a subscriber, which is recognized by the policy holder.\r\n\r\n**Note:** The party playing the role of a dependent is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a dependent may make a claim under a policy, e.g., a dependent under a health insurance policy may become the claimant for coverage under that policy for wellness examines or if injured and there is no liable third party. In the case of a dependent making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that the dependent has filed a claim for services covered under the health insurance policy.\r\n\r\n**Example:** The dependent has an association with the subscriber such as a financial dependency or personal relationship such as that of a spouse, or a natural or adopted child. The policy holder may be required by law to recognize certain associations or may have discretion about the associations. For example, a policy holder may dictate the criteria for the dependent status of adult children who are students, such as requiring full time enrollment, or may recognize domestic partners as dependents. Under certain circumstances, the dependent may be under the indirect authority of a responsible party acting as a surrogate for the subscriber, for example, if the subscriber is differently abled or deceased, a guardian ad Lidem or estate executor may be appointed to assume the subscriberaTMs legal standing in the relationship with the dependent.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21960"},{"code":"Name:Class","valueCode":"dependent"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"INDIV","display":"individual","definition":"**Description:** A role played by a party covered under a policy as the policy holder. An individual may be either a person or an organization.\r\n\r\n**Note:** The party playing the role of an individual insured is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a named insured may make a claim under a policy, e.g., a party that is the named insured and policy holder under a comprehensive automobile insurance policy may become the claimant for coverage under that policy if injured in an automobile accident and there is no liable third party. In the case of an individual insured making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that an individual insured has filed a claim for a loss.\r\n\r\n**Example:** The individual insured under a comprehensive automobile, disability, or property and casualty policy that is the policy holder.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21958"},{"code":"Name:Class","valueCode":"individual"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"SUBSCR","display":"subscriber","definition":"**Description:** A role played by a person covered under a policy based on association with a sponsor who is the policy holder, and whose association may provide for the eligibility of dependents for coverage.\r\n\r\n**Discussion:** The policy holder holds the contract with the policy or program underwriter. The subscriber holds a certificate of coverage under the contract. In legal proceedings concerning the policy or program, the terms of the contract takes precedence over the terms of the certificate of coverage if there are any inconsistencies.\r\n\r\n**Note:** The party playing the role of a subscriber is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a subscriber may make a claim under a policy, e.g., a subscriber under a health insurance policy may become the claimant for coverage under that policy for wellness examines or if injured and there is no liable third party. In the case of a subscriber making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that the subscriber has filed a claim for services covered under the health insurance policy.\r\n\r\n**Example:** An employee or a member of an association.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21959"},{"code":"Name:Class","valueCode":"subscriber"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"PROG","display":"program eligible","definition":"**Description:** A role played by a party that meets the eligibility criteria for coverage under a program. A program eligible may be either a person, non-person living subject, or an organization, or a group of persons, non-person living subjects, or organizations.\r\n\r\n**Discussion:** A program as typically government administered coverage for parties determined eligible under the terms of the program.\r\n\r\n**Note:** The party playing a program eligible is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However a program eligible may make a claim under program, e.g., an unemployed worker may claim benefits under an unemployment insurance program, but parties playing these covered party role classes are not, for purposes of this vocabulary and in an effort to clearly distinguish role classes, considered claimants.\r\n\r\nIn the case of a program eligible, a role type code INJWKR (injured worker) subtypes the class to indicate that the covered party in a workers compensation program is an injured worker, and as such, has filed a \"claim\" under the program for benefits. Likewise, a covered role type code UNEMP (unemployed worker) subtypes the program eligible class to indicate that the covered party in an unemployment insurance program has filed a claim for unemployment benefits.\r\n\r\n**Example:** A party meeting eligibility criteria related to health or financial status, e.g., in the U.S., persons meeting health, demographic, or financial criteria established by state and federal law are eligible for Medicaid.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21956"},{"code":"Name:Class","valueCode":"programEligible"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"CRINV","display":"clinical research investigator","definition":"A role played by a provider, always a person, who has agency authority from a Clinical Research Sponsor to direct the conduct of a clinical research trial or study on behalf of the sponsor.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19164"},{"code":"Name:Class","valueCode":"clinicalResearchInvestigator"},{"code":"Name:Role:player:Entity","valueCode":"investigator&"},{"code":"Name:Role:scoper:Entity","valueCode":"sponsoring&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAH____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAH____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"CRSPNSR","display":"clinical research sponsor","definition":"A role played by an entity, usually an organization, that is the sponsor of a clinical research trial or study. The sponsor commissions the study, bears the expenses, is responsible for satisfying all legal requirements concerning subject safety and privacy, and is generally responsible for collection, storage and analysis of the data generated during the trial. No scoper is necessary, as a clinical research sponsor undertakes the role on its own authority and declaration. Clinical research sponsors are usually educational or other research organizations, government agencies or biopharmaceutical companies.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19165"},{"code":"Name:Class","valueCode":"clinicalResearchSponsor"},{"code":"Name:Role:player:Entity","valueCode":"sponsor&"},{"code":"Name:Role:scoper:Entity","valueCode":"sponsorshipAuthorizing&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAG____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAG____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"EMP","display":"employee","definition":"A relationship between a person or organization and a person or organization formed for the purpose of exchanging work for compensation. The purpose of the role is to identify the type of relationship the employee has to the employer, rather than the nature of the work actually performed. (Contrast with AssignedEntity.)","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11569"},{"code":"Name:Class","valueCode":"employment"},{"code":"Name:Role:player:Entity","valueCode":"employee&"},{"code":"Name:Role:scoper:Entity","valueCode":"employer&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAE____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAE____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"MIL","display":"military person","definition":"A role played by a member of a military service. Scoper is the military service (e.g. Army, Navy, Air Force, etc.) or, more specifically, the unit (e.g. Company C, 3rd Battalion, 4th Division, etc.)","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11570"},{"code":"Name:Class","valueCode":"militaryPerson"},{"code":"Name:Role:player:Entity","valueCode":"military&"},{"code":"Name:Role:scoper:Entity","valueCode":"militaryService(&-ORG)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAEA___"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAEA___"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"GUAR","display":"guarantor","definition":"A person or organization (player) that serves as a financial guarantor for another person or organization (scoper).","designation":[{"language":"en","use":{"system":"http://snomed.info/sct","code":"900000000000013009"},"value":"GuarantorRole"}],"property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"13941"},{"code":"Name:Class","valueCode":"guarantor"},{"code":"Name:Role:player:Entity","valueCode":"guarantor&"},{"code":"Name:Role:scoper:Entity","valueCode":"promisor&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAJ____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAJ____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"INVSBJ","display":"Investigation Subject","definition":"An entity that is the subject of an investigation. This role is scoped by the party responsible for the investigation.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21464"},{"code":"Name:Class","valueCode":"investigativeSubject"},{"code":"Name:Role:player:Entity","valueCode":"subject&"},{"code":"Name:Role:scoper:Entity","valueCode":"investigationSponsor"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAB____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAB____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"CASEBJ","display":"Case Subject","definition":"A person, non-person living subject, or place that is the subject of an investigation related to a notifiable condition (health circumstance that is reportable within the applicable public health jurisdiction)","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21465"},{"code":"Name:Class","valueCode":"caseSubject"},{"code":"Name:Role:player:Entity","valueCode":"subject&"},{"code":"Name:Role:scoper:Entity","valueCode":"caseMonitor"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAABA___"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAABA___"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"RESBJ","display":"research subject","definition":"**Definition:**Specifies the administrative functionality within a formal experimental design for which the ResearchSubject role was established.\r\n\r\n**Examples:** Screening - role is used for pre-enrollment evaluation portion of the design; enrolled - role is used for subjects admitted to the experimental portion of the design.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19166"},{"code":"Name:Class","valueCode":"researchSubject"},{"code":"Name:Role:player:Entity","valueCode":"subject&"},{"code":"Name:Role:scoper:Entity","valueCode":"researchSponsor"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAABB___"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAABB___"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"LIC","display":"licensed entity","definition":"A relationship in which the scoper certifies the player ( e. g. a medical care giver, a medical device or a provider organization) to perform certain activities that fall under the jurisdiction of the scoper (e.g., a health authority licensing healthcare providers, a medical quality authority certifying healthcare professionals).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16773"},{"code":"Name:Class","valueCode":"licensedEntity"},{"code":"Name:Role:player:Entity","valueCode":"subject&"},{"code":"Name:Role:scoper:Entity","valueCode":"(issuing&)|issuer"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAC____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAC____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"NOT","display":"notary public","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11576"},{"code":"Name:Class","valueCode":"notaryPublic"},{"code":"Name:Role:player:Entity","valueCode":"notaryPublic&"},{"code":"Name:Role:scoper:Entity","valueCode":"political(&|Entity)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAACB___"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAACB___"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PROV","display":"healthcare provider","definition":"An Entity (player) that is authorized to provide health care services by some authorizing agency (scoper).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11599"},{"code":"Name:Class","valueCode":"healthCareProvider"},{"code":"Name:Role:player:Entity","valueCode":"healthCare(&|Provider)"},{"code":"Name:Role:scoper:Entity","valueCode":"(issuing&)|issuer"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAACA___"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAACA___"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"PAT","display":"patient","definition":"A Role of a LivingSubject (player) as an actual or potential recipient of health care services from a healthcare provider organization (scoper).\r\n\r\n*Usage Note:* Communication about relationships between patients and specific healthcare practitioners (people) is not done via scoper. Instead this is generally done using the CareProvision act. This allows linkage between patient and a particular healthcare practitioner role and also allows description of the type of care involved in the relationship.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11577"},{"code":"Name:Class","valueCode":"patient"},{"code":"Name:Role:player:Entity","valueCode":"patient&"},{"code":"Name:Role:scoper:Entity","valueCode":"provider&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAA____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAA____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PAYEE","display":"payee","definition":"The role of an organization or individual designated to receive payment for a claim against a particular coverage. The scoping entity is the organization that is the submitter of the invoice in question.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14015"},{"code":"Name:Class","valueCode":"payee"},{"code":"Name:Role:player:Entity","valueCode":"payee&"},{"code":"Name:Role:scoper:Entity","valueCode":"invoicing&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAK____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAK____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PAYOR","display":"invoice payor","definition":"The role of an organization that undertakes to accept claims invoices, assess the coverage or payments due for those invoices and pay to the designated payees for those invoices. This role may be either the underwriter or a third-party organization authorized by the underwriter. The scoping entity is the organization that underwrites the claimed coverage.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14014"},{"code":"Name:Class","valueCode":"payor"},{"code":"Name:Role:player:Entity","valueCode":"invoicePayor&"},{"code":"Name:Role:scoper:Entity","valueCode":"(underwriting&)|underwriter"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAL____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAL____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"POLHOLD","display":"policy holder","definition":"A role played by a person or organization that holds an insurance policy. The underwriter of that policy is the scoping entity.\r\n\r\n*Discussion:*The identifier of the policy is captured in 'Role.id' when the Role is a policy holder.\r\n\r\nA particular policy may cover several individuals one of whom may be, but need not be, the policy holder. Thus the notion of covered party is a role that is distinct from that of the policy holder.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14010"},{"code":"Name:Class","valueCode":"policyHolder"},{"code":"Name:Role:player:Entity","valueCode":"policyHolder&"},{"code":"Name:Role:scoper:Entity","valueCode":"(underwriting&)|underwriter"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAM____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAM____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"QUAL","display":"qualified entity","definition":"An entity (player) that has been recognized as having certain training/experience or other characteristics that would make said entity an appropriate performer for a certain activity. The scoper is an organization that educates or qualifies entities.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11619"},{"code":"Name:Class","valueCode":"qualifiedEntity"},{"code":"Name:Role:player:Entity","valueCode":"qualified(&|Entity)"},{"code":"Name:Role:scoper:Entity","valueCode":"qualificationGranting(&|Entity)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAP____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAP____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"SPNSR","display":"coverage sponsor","definition":"A role played by an entity, usually an organization that is the sponsor of an insurance plan or a health program. A sponsor is the party that is ultimately accountable for the coverage by employment contract or by law. A sponsor can be an employer, union, government agency, or association. Fully insured sponsors establish the terms of the plan and contract with health insurance plans to assume the risk and to administer the plan. Self-insured sponsors delegate coverage administration, but not risk, to third-party administrators. Program sponsors designate services to be covered in accordance with statute. Program sponsors may administer the coverage themselves, delegate coverage administration, but not risk to third-party administrators, or contract with health insurance plans to assume the risk and administrator a program. Sponsors qualify individuals who may become\r\n\r\n1.  a policy holder of the plan;\r\n2.  where the sponsor is the policy holder, who may become a subscriber or a dependent to a policy under the plan; or\r\n3.  where the sponsor is a government agency, who may become program eligibles under a program.\r\n\r\nThe sponsor role may be further qualified by the SponsorRole.code. Entities playing the sponsor role may also play the role of a Coverage Administrator.\r\n\r\n*Example:* An employer, union, government agency, or association.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14012"},{"code":"Name:Class","valueCode":"sponsor"},{"code":"Name:Role:player:Entity","valueCode":"sponsor&"},{"code":"Name:Role:scoper:Entity","valueCode":"(underwriting&)|underwriter"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAN____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAN____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"STD","display":"student","definition":"A role played by an individual who is a student of a school, which is the scoping entity.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"12248"},{"code":"Name:Class","valueCode":"student"},{"code":"Name:Role:player:Entity","valueCode":"student"},{"code":"Name:Role:scoper:Entity","valueCode":"school(&|Entity)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAQ____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAQ____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"UNDWRT","display":"underwriter","definition":"A role played by a person or an organization. It is the party that\r\n\r\n1.  accepts fiscal responsibility for insurance plans and the policies created under those plans;\r\n2.  administers and accepts fiscal responsibility for a program that provides coverage for services to eligible individuals; and/or\r\n3.  has the responsibility to assess the merits of each risk and decide a suitable premium for accepting all or part of the risk. If played by an organization, this role may be further specified by an appropriate RoleCode.\r\n\r\n*Example:*\r\n\r\n1.  A health insurer;\r\n2.  Medicaid Program;\r\n3.  Lloyd's of London","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14009"},{"code":"Name:Class","valueCode":"underwriter"},{"code":"Name:Role:player:Entity","valueCode":"(underwriting&)|underwriter"},{"code":"Name:Role:scoper:Entity","valueCode":"scoper&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAAO____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAAO____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"CAREGIVER","display":"caregiver","definition":"A person responsible for the primary care of a patient at home.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21355"},{"code":"Name:Class","valueCode":"careGiver"},{"code":"Name:Role:player:Entity","valueCode":"careGiver&"},{"code":"Name:Role:scoper:Entity","valueCode":"careGiverScoper"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAC_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAC_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PRS","display":"personal relationship","definition":"Links two entities with classCode PSN (person) in a personal relationship. The character of the relationship must be defined by a PersonalRelationshipRoleType code. The player and scoper are determined by PersonalRelationshipRoleType code as well.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19167"},{"code":"Name:Class","valueCode":"personalRelationship"},{"code":"Name:Role:player:Entity","valueCode":"relationshipHolder"},{"code":"Name:Role:scoper:Entity","valueCode":"personalRelationshipWith"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAAB_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAAB_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"SELF","display":"self","definition":"The \"same\" roleclass asserts an identity between playing and scoping entities: that they are in fact instances of the same entity and, in the case of discrepancies (e.g different DOB, gender), that one or both are in error.\r\n\r\n*Usage:*\r\n\r\nplaying and scoping entities must have same classcode, but need not have identical attributes or values.\r\n\r\n*Example:* \r\n\r\na provider registry maintains sets of conflicting demographic data for what is reported to be the same individual.","property":[{"code":"status","valueCode":"retired"},{"code":"internalId","valueCode":"21437"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"_RoleClassPassive","display":"RoleClassPassive","definition":"An association for a playing Entity that is used, known, treated, handled, built, or destroyed, etc. under the auspices of the scoping Entity. The playing Entity is passive in these roles (even though it may be active in other roles), in the sense that the kinds of things done to it in this role happen without an agreement from the playing Entity.","property":[{"code":"notSelectable","valueBoolean":true},{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21117"},{"code":"Name:Class","valueCode":"passiveRelation"},{"code":"Name:Role:player:Entity","valueCode":"playing&"},{"code":"Name:Role:scoper:Entity","valueCode":"scoping&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAB______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAB______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"ACCESS","display":"access","definition":"A role in which the playing entity (material) provides access to another entity. The principal use case is intravenous (or other bodily) access lines that preexist and need to be referred to for medication routing instructions.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11592"},{"code":"Name:Class","valueCode":"access"},{"code":"Name:Role:player:Entity","valueCode":"access&"},{"code":"Name:Role:scoper:Entity","valueCode":"accessed&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABM_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABM_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"ADJY","display":"adjacency","definition":"A physical association whereby two Entities are in some (even lose) spatial relationship with each other such that they touch each other in some way.\r\n\r\n*Examples:* the colon is connected (and therefore adjacent) to the jejunum; the colon is adjacent to the liver (even if not actually connected.)\r\n\r\n*UsageConstraints:* Adjacency is in principle a symmetrical connection, but scoper and player of the role should, where applicable, be assigned to have scoper be the larger, more central Entity and player the smaller, more distant, appendage.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23095"},{"code":"Name:Class","valueCode":"adjacency"},{"code":"Name:Role:player:Entity","valueCode":"distal&"},{"code":"Name:Role:scoper:Entity","valueCode":"proximal&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAB______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAB______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"CONC","display":"connection","definition":"An adjacency of two Entities held together by a bond which attaches to each of the two entities.\r\n\r\n*Examples:* biceps brachii muscle connected to the radius bone, port 3 on a network switch connected to port 5 on a patch panel.\r\n\r\n*UsageConstraints:* See Adjacency for the assignment of scoper (larger, more central) and player (smaller, more distant).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23096"},{"code":"Name:Class","valueCode":"connection"},{"code":"Name:Role:player:Entity","valueCode":"distal&"},{"code":"Name:Role:scoper:Entity","valueCode":"proximal&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAB______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAB______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"BOND","display":"molecular bond","definition":"A connection between two atoms of a molecule.\r\n\r\n*Examples:* double bond between first and second C in ethane, peptide bond between two amino-acid, disulfide bridge between two proteins, chelate and ion associations, even the much weaker van-der-Waals bonds can be considered molecular bonds.\r\n\r\n*UsageConstraints:* See connection and adjacency for the assignment of player and scoper.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23098"},{"code":"Name:Class","valueCode":"bond"},{"code":"Name:Role:player:Entity","valueCode":"distal&"},{"code":"Name:Role:scoper:Entity","valueCode":"proximal&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAB______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAB______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"CONY","display":"continuity","definition":"A connection between two regional parts.\r\n\r\n*Examples:*  the connection between ascending aorta and the aortic arc, connection between descending colon and sigmoid.\r\n\r\n*UsageConstraints:* See connection and adjacency for the assignment of player and scoper.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23097"},{"code":"Name:Class","valueCode":"continuity"},{"code":"Name:Role:player:Entity","valueCode":"distal&"},{"code":"Name:Role:scoper:Entity","valueCode":"proximal&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AAB______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AAB______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]}]},{"code":"ADMM","display":"Administerable Material","definition":"A material (player) that can be administered to an Entity (scoper).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21435"},{"code":"Name:Class","valueCode":"administrableMaterial"},{"code":"Name:Role:player:Entity","valueCode":"administrable(&|Product)"},{"code":"Name:Role:scoper:Entity","valueCode":"(scoping&)|scoper"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABO_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABO_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"BIRTHPL","display":"birthplace","definition":"Relates a place (playing Entity) as the location where a living subject (scoping Entity) was born.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11589"},{"code":"Name:Class","valueCode":"birthplace"},{"code":"Name:Role:player:Entity","valueCode":"birthplace"},{"code":"Name:Role:scoper:Entity","valueCode":"birthplaceFor&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABL_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABL_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"DEATHPLC","display":"place of death","definition":"Definition: Relates a place (playing Entity) as the location where a living subject (scoping Entity) died.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21640"},{"code":"Name:Class","valueCode":"placeOfDeath"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"DST","display":"distributed material","definition":"A material (player) distributed by a distributor (scoper) who functions between a manufacturer and a buyer or retailer.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10418"},{"code":"Name:Class","valueCode":"distributedProduct"},{"code":"Name:Role:player:Entity","valueCode":"distributed(&|Product)"},{"code":"Name:Role:scoper:Entity","valueCode":"(distributing&)|distributor"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABB_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABB_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"RET","display":"retailed material","definition":"Material (player) sold by a retailer (scoper), who also give advice to prospective buyers.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10419"},{"code":"Name:Class","valueCode":"retailedProduct"},{"code":"Name:Role:player:Entity","valueCode":"retailed(&|Product)"},{"code":"Name:Role:scoper:Entity","valueCode":"retailer&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABBA____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABBA____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"EXLOC","display":"event location","definition":"A role played by a place at which the location of an event may be recorded.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23368"},{"code":"Name:Class","valueCode":"eventLocation"},{"code":"Name:Role:player:Entity","valueCode":"EventLocation(&-PLC)"},{"code":"Name:role:scoper:Entity","valueCode":"initiator&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABI_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABI_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"SDLOC","display":"service delivery location","definition":"A role played by a place at which services may be provided.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16927"},{"code":"Name:Class","valueCode":"serviceDeliveryLocation"},{"code":"Name:Role:player:Entity","valueCode":"location(&-PLC)"},{"code":"Name:Role:scoper:Entity","valueCode":"serviceProvider&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABJ_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABJ_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"DSDLOC","display":"dedicated service delivery location","definition":"A role of a place (player) that is intended to house the provision of services. Scoper is the Entity (typically Organization) that provides these services. This is not synonymous with \"ownership.\"","designation":[{"language":"en","use":{"system":"http://snomed.info/sct","code":"900000000000013009"},"value":"health care facility"}],"property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11600"},{"code":"Name:Class","valueCode":"dedicatedServiceDeliveryLocation"},{"code":"Name:Role:player:Entity","valueCode":"location(&-PLC)"},{"code":"Name:Role:scoper:Entity","valueCode":"recognizing&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABJB____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABJB____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"ISDLOC","display":"incidental service delivery location","definition":"A role played by a place at which health care services may be provided without prior designation or authorization.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16929"},{"code":"Name:Class","valueCode":"incidentalServiceDeliveryLocation"},{"code":"Name:Role:player:Entity","valueCode":"location(&-PLC)"},{"code":"Name:Role:scoper:Entity","valueCode":"recognizing&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABJA____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABJA____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]}]},{"code":"EXPR","display":"exposed entity","definition":"A role played by an entity that has been exposed to a person or animal suffering a contagious disease, or with a location from which a toxin has been distributed. The player of the role is normally a person or animal, but it is possible that other entity types could become exposed. The role is scoped by the source of the exposure, and it is quite possible for a person playing the role of exposed party to also become the scoper a role played by another person. That is to say, once a person has become infected, it is possible, perhaps likely, for that person to infect others.\r\n\r\nManagement of exposures and tracking exposed parties is a key function within public health, and within most public health contexts - exposed parties are known as \"contacts.\"","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19131"},{"code":"Name:Class","valueCode":"exposedEntity"},{"code":"Name:Role:player:Entity","valueCode":"exposed&"},{"code":"Name:Role:scoper:Entity","valueCode":"exposing&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABN_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABN_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"HLD","display":"held entity","definition":"Entity that is currently in the possession of a holder (scoper), who holds, or uses it, usually based on some agreement with the owner.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10422"},{"code":"Name:Class","valueCode":"heldEntity"},{"code":"Name:Role:player:Entity","valueCode":"held(&|Entity)"},{"code":"Name:Role:scoper:Entity","valueCode":"(holding&)|holder"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABC_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABC_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"HLTHCHRT","display":"health chart","definition":"The role of a material (player) that is the physical health chart belonging to an organization (scoper).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11618"},{"code":"Name:Class","valueCode":"healthChart"},{"code":"Name:Role:player:Entity","valueCode":"healthChart&"},{"code":"Name:Role:scoper:Entity","valueCode":"subject&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABI_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABI_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"IDENT","display":"identified entity","definition":"A role in which the scoping entity designates an identifier for a playing entity.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16721"},{"code":"Name:Class","valueCode":"identifiedEntity"},{"code":"Name:Role:player:Entity","valueCode":"identified(&|Entity)"},{"code":"Name:Role:scoper:Entity","valueCode":"assigning(&|Authority)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABA_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABA_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"MANU","display":"manufactured product","definition":"Scoped by the manufacturer","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11580"},{"code":"Name:Class","valueCode":"manufacturedProduct"},{"code":"Name:Role:player:Entity","valueCode":"manufactured(&|Product)"},{"code":"Name:Role:scoper:Entity","valueCode":"manufacturer&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABD_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABD_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"THER","display":"therapeutic agent","definition":"A manufactured material (player) that is used for its therapeutic properties. The manufacturer is the scoper.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11581"},{"code":"Name:Class","valueCode":"manufacturedProduct"},{"code":"Name:Role:player:Entity","valueCode":"manufactured(&|Product)"},{"code":"Name:Role:scoper:Entity","valueCode":"manufacturer&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABDA____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABDA____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"MNT","display":"maintained entity","definition":"An entity (player) that is maintained by another entity (scoper). This is typical role held by durable equipment. The scoper assumes responsibility for proper operation, quality, and safety.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10427"},{"code":"Name:Class","valueCode":"maintainedEntity"},{"code":"Name:Role:player:Entity","valueCode":"maintained(&|Entity)"},{"code":"Name:Role:scoper:Entity","valueCode":"(maintaining&)|maintainer"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABE_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABE_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"OWN","display":"owned entity","definition":"An Entity (player) for which someone (scoper) is granted by law the right to call the material (player) his own. This entitles the scoper to make decisions about the disposition of that material.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10421"},{"code":"Name:Class","valueCode":"ownedEntity"},{"code":"Name:Role:player:Entity","valueCode":"owned(&|Entity)"},{"code":"Name:Role:scoper:Entity","valueCode":"(owning&)|owner"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABF_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABF_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"RGPR","display":"regulated product","definition":"A product regulated by some governmentatl orgnization. The role is played by Material and scoped by Organization.\r\n\r\nRationale: To support an entity clone used to identify the NDC number for a drug product.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19132"},{"code":"Name:Class","valueCode":"regulatedProduct"},{"code":"Name:Role:player:Entity","valueCode":"regulated(&|Product)"},{"code":"Name:Role:scoper:Entity","valueCode":"regulator&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABH_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABH_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"TERR","display":"territory of authority","definition":"Relates a place entity (player) as the region over which the scoper (typically an Organization) has certain authority (jurisdiction). For example, the Calgary Regional Health Authority (scoper) has authority over the territory \"Region 4 of Alberta\" (player) in matters of health.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11583"},{"code":"Name:Class","valueCode":"territorialAuthority"},{"code":"Name:Role:player:Entity","valueCode":"territory(&-PLC)"},{"code":"Name:Role:scoper:Entity","valueCode":"governing&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABK_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABK_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"USED","display":"used entity","definition":"**Description:**An entity (player) that is used by another entity (scoper)","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22755"},{"code":"Name:Class","valueCode":"usedEntity"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"WRTE","display":"warranted product","definition":"A role a product plays when a guarantee is given to the purchaser by the seller (scoping entity) stating that the product is reliable and free from known defects and that the seller will repair or replace defective parts within a given time limit and under certain conditions.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16300"},{"code":"Name:Class","valueCode":"warrantedProduct"},{"code":"Name:Role:player:Entity","valueCode":"warranted(&|Product)"},{"code":"Name:Role:scoper:Entity","valueCode":"(warranting&)|warranter"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AABG_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AABG_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]}]},{"code":"_RoleClassOntological","display":"RoleClassOntological","definition":"A relationship in which the scoping Entity defines or specifies what the playing Entity is. Thus, the player's \"being\" (Greek: ontos) is specified.","property":[{"code":"notSelectable","valueBoolean":true},{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21115"},{"code":"Name:Class","valueCode":"definedEntity"},{"code":"Name:Role:player:Entity","valueCode":"defined&"},{"code":"Name:Role:scoper:Entity","valueCode":"defining&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AC_______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AC_______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"EQUIV","display":"equivalent entity","definition":"**Description:** Specifies the player Entity (the equivalent Entity) as an Entity that is considered to be equivalent to a reference Entity (scoper). The equivalence is in principle a symmetric relationship, however, it is expected that the scoper is a reference entity which serves as reference entity for multiple different equivalent entities.\r\n\r\n**Examples:** An innovator's medicine formulation is the reference for \"generics\", i.e., formulations manufactured differently but having been proven to be biologically equivalent to the reference medicine. Another example is a reference ingredient that serves as basis for quantity specifications (basis of strength, e.g., metoprolol succinate specified in terms of metoprolol tartrate.)","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22399"},{"code":"Name:Class","valueCode":"equivalentEntity"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"SAME","display":"same","definition":"The \"same\" role asserts an identity between playing and scoping entities, i.e., that they are in fact two records of the same entity instance, and, in the case of discrepancies (e.g different DOB, gender), that one or both are in error.\r\n\r\n*Usage:*\r\n\r\nplaying and scoping entities must have same classCode, but need not have identical attributes or values.\r\n\r\n*Example:* \r\n\r\na provider registry maintains sets of conflicting demographic data for what is reported to be the same individual.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21488"},{"code":"Name:Class","valueCode":"same"},{"code":"Name:Role:player:Entity","valueCode":"same&"},{"code":"Name:Role:scoper:Entity","valueCode":"same&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ACE______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ACE______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"SUBY","display":"subsumed by","definition":"Relates a prevailing record of an Entity (scoper) with another record (player) that it subsumes.\r\n\r\n*Examples:* Show a correct new Person object (scoper) that subsumes one or more duplicate Person objects that had accidentally been created for the same physical person.\r\n\r\n*Constraints:* Both the player and scoper must have the same classCode.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"20070"},{"code":"Name:Class","valueCode":"subsumedBy"},{"code":"Name:Role:player:Entity","valueCode":"subsuming&"},{"code":"Name:Role:scoper:Entity","valueCode":"subsumed&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ACD______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ACD______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"GEN","display":"has generalization","definition":"Relates a specialized material concept (player) to its generalization (scoper).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10441"},{"code":"Name:Class","valueCode":"specializedKind"},{"code":"Name:Role:player:Entity","valueCode":"specialized(&|Kind)"},{"code":"Name:Role:scoper:Entity","valueCode":"generalized(&|Kind)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ACA______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ACA______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"GRIC","display":"has generic","definition":"A special link between pharmaceuticals indicating that the target (scoper) is a generic for the source (player).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10442"},{"code":"Name:Class","valueCode":"entityWithGeneric"},{"code":"Name:Role:player:Entity","valueCode":"specialized(&|Kind)"},{"code":"Name:Role:scoper:Entity","valueCode":"generic(&|Kind)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ACAA_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ACAA_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"INST","display":"instance","definition":"An individual piece of material (player) instantiating a class of material (scoper).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10443"},{"code":"Name:Class","valueCode":"instanceOfKind"},{"code":"Name:Role:player:Entity","valueCode":"&Instance"},{"code":"Name:Role:scoper:Entity","valueCode":"kindOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ACB______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ACB______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"SUBS","display":"subsumer","definition":"An entity that subsumes the identity of another. Used in the context of merging documented entity instances. Both the player and scoper must have the same classCode.\r\n\r\nThe use of this code is **deprecated** in favor of the term SUBY which is its inverse and is more ontologically correct.","property":[{"code":"status","valueCode":"deprecated"},{"code":"deprecationDate","valueDateTime":"2011-12-01"},{"code":"internalId","valueCode":"16241"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"_RoleClassPartitive","display":"RoleClassPartitive","definition":"An association between two Entities where the playing Entity is considered in some way \"part\" of the scoping Entity, e.g., as a member, component, ingredient, or content. Being \"part\" in the broadest sense of the word can mean anything from being an integral structural component to a mere incidental temporary association of a playing Entity with a (generally larger) scoping Entity.","property":[{"code":"notSelectable","valueBoolean":true},{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"21116"},{"code":"Name:Class","valueCode":"partOfWhole"},{"code":"Name:Role:player:Entity","valueCode":"part&"},{"code":"Name:Role:scoper:Entity","valueCode":"whole&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"AB_______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"AB_______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"CONT","display":"content","definition":"Relates a material as the content (player) to a container (scoper). Unlike ingredients, the content and a container remain separate (not mixed) and the content can be removed from the container. A content is not part of an empty container.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10438"},{"code":"Name:Class","valueCode":"content"},{"code":"Name:Role:player:Entity","valueCode":"(contained(&-MAT))|content"},{"code":"Name:Role:scoper:Entity","valueCode":"container&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABB______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABB______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"EXPAGTCAR","display":"exposure agent carrier","definition":"An exposure agent carrier is an entity that is capable of conveying an exposure agent from one entity to another. The scoper of the role must be the exposure agent (e.g., pathogen).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22350"},{"code":"Name:Class","valueCode":"exposureAgentCarrier"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"EXPVECTOR","display":"exposure vector","definition":"**Description:** A vector is a living subject that carries an exposure agent. The vector does not cause the disease itself, but exposes targets to the exposure agent. A mosquito carrying malaria is an example of a vector. The scoper of the role must be the exposure agent (e.g., pathogen).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22351"},{"code":"Name:Class","valueCode":"exposureVector"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"FOMITE","display":"fomite","definition":"**Description:** A fomite is a non-living entity that is capable of conveying exposure agent from one entity to another. A doorknob contaminated with a Norovirus is an example of a fomite. Anyone touching the doorknob would be exposed to the virus. The scoper of the role must be the exposure agent (e.g., pathogen).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22352"},{"code":"Name:Class","valueCode":"fomite"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"INGR","display":"ingredient","definition":"Relates a component (player) to a mixture (scoper). E.g., Glucose and Water are ingredients of D5W, latex may be an ingredient in a tracheal tube.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10430"},{"code":"Name:Class","valueCode":"ingredient"},{"code":"Name:Role:player:Entity","valueCode":"ingredient&"},{"code":"Name:Role:scoper:Entity","valueCode":"ingredientOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABD______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABD______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"ACTI","display":"active ingredient","definition":"**Definition:** a therapeutically active ingredient (player) in a mixture (scoper), where the mixture is typically a manufactured pharmaceutical. It is unknown if the quantity of such an ingredient is expressed precisely in terms of the playing ingredient substance, or, if it is specified in terms of a closely related substance (active moiety or reference substance).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10433"},{"code":"Name:Class","valueCode":"activeIngredient"},{"code":"Name:Role:player:Entity","valueCode":"activeIngredient&"},{"code":"Name:Role:scoper:Entity","valueCode":"ingredientOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDA_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDA_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"ACTIB","display":"active ingredient - basis of strength","definition":"**Description:**  Active ingredient, where the ingredient substance (player) is itself the \"basis of strength\", i.e., where the Role.quantity specifies exactly the quantity of the player substance in the medicine formulation.\r\n\r\n**Examples:** Lopressor 50 mg actually contains 50 mg of metoprolol succinate, even though the active moiety is metoprolol, but also: Tenormin 50 mg contain 50 mg of atenolol, as free base, i.e., where the active ingredient atenolol is also the active moiety.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22396"},{"code":"Name:Class","valueCode":"activeIngredientBasisOfStrength"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"ACTIM","display":"active ingredient - moiety is basis of strength","definition":"**Description:** Active ingredient, where not the ingredient substance (player), but itaTMs active moiety is the \"basis of strength\", i.e., where the Role.quantity specifies the quantity of the player substance's active moiety in the medicine formulation.\r\n\r\n**Examples:** 1 mL of Betopic 5mg/mL eye drops contains 5.6 mg betaxolol hydrochloride equivalent to betaxolol base 5 mg.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22397"},{"code":"Name:Class","valueCode":"activeIngredientMoietyIsBasisOfStrength"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"ACTIR","display":"active ingredient - reference substance is basis of strength","definition":"**Description:** Active ingredient, where not the ingredient substance (player) but another reference substance with the same active moiety, is the \"basis of strength\", i.e., where the Role.quantity specifies the quantity of a reference substance, similar but different from the player substance's in the medicine formulation.\r\n\r\n**Examples:** Toprol-XL 50 mg contains 47.5 mg of metoprolol succinate equivalent to 50 mg of metoprolol tartrate.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"22398"},{"code":"Name:Class","valueCode":"activeIngredientReferenceSubstanceIsBasisOfStrength"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"ADJV","display":"adjuvant","definition":"A component (player) added to enhance the action of an active ingredient (scoper) (in the manner of a catalyst) but which has no active effect in and of itself. Such ingredients are significant in defining equivalence of products in a way that inactive ingredients are not.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23059"},{"code":"Name:Class","valueCode":"adjuvant"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"ADTV","display":"additive","definition":"An ingredient (player) that is added to a base (scoper), that amounts to a minor part of the overall mixture.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10432"},{"code":"Name:Class","valueCode":"additive"},{"code":"Name:Role:player:Entity","valueCode":"additive&"},{"code":"Name:Role:scoper:Entity","valueCode":"additiveOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDE_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDE_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"BASE","display":"base","definition":"A base ingredient (player) is what comprises the major part of a mixture (scoper). E.g., Water in most i.v. solutions, or Vaseline in salves. Among all ingredients of a material, there should be only one base. A base substance can, in turn, be a mixture.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10431"},{"code":"Name:Class","valueCode":"base"},{"code":"Name:Role:player:Entity","valueCode":"base&"},{"code":"Name:Role:scoper:Entity","valueCode":"baseOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDC_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDC_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"CNTM","display":"contaminant ingredient","definition":"An ingredient whose presence is not intended but may not be reasonably avoided given the circumstances of the mixture's nature or origin.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23369"},{"code":"Name:Class","valueCode":"contaminant"},{"code":"Name:Role:player:Entity","valueCode":"contaminant&"},{"code":"Name:role:scoper:Entity","valueCode":"contaminantOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDF_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDF_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"IACT","display":"inactive ingredient","definition":"An ingredient which is not considered therapeutically active, e.g., colors, flavors, stabilizers, or preservatives, fillers, or structural components added to an active ingredient in order to facilitate administration of the active ingredient but without being considered therapeutically active. An inactive ingredient need not be biologically inert, e.g., might be active as an allergen or might have a pleasant taste, but is not an essential constituent delivering the therapeutic effect.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19089"},{"code":"Name:Class","valueCode":"inactiveIngredient"},{"code":"Name:Role:player:Entity","valueCode":"inactiveIngredient&"},{"code":"Name:Role:scoper:Entity","valueCode":"ingredientOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDD_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDD_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"COLR","display":"color additive","definition":"A substance (player) influencing the optical aspect of material (scoper).","designation":[{"language":"en","use":{"system":"http://snomed.info/sct","code":"900000000000013009"},"value":"color"}],"property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10437"},{"code":"Name:Class","valueCode":"colorAdditive"},{"code":"Name:Role:player:Entity","valueCode":"color&"},{"code":"Name:Role:scoper:Entity","valueCode":"additiveOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDDC____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDDC____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"FLVR","display":"flavor additive","definition":"A substance (player) added to a mixture (scoper) to make it taste a certain way. In food the use is obvious, in pharmaceuticals flavors can hide disgusting taste of the active ingredient (important in pediatric treatments).","designation":[{"language":"en","use":{"system":"http://snomed.info/sct","code":"900000000000013009"},"value":"flavor"}],"property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10436"},{"code":"Name:Class","valueCode":"flavorAdditive"},{"code":"Name:Role:player:Entity","valueCode":"flavor&"},{"code":"Name:Role:scoper:Entity","valueCode":"additiveOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDDD____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDDD____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PRSV","display":"preservative","definition":"A substance (player) added to a mixture (scoper) to prevent microorganisms (fungi, bacteria) to spoil the mixture.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10435"},{"code":"Name:Class","valueCode":"preservative"},{"code":"Name:Role:player:Entity","valueCode":"preservative&"},{"code":"Name:Role:scoper:Entity","valueCode":"preservativeOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDDA____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDDA____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"STBL","display":"stabilizer","definition":"A stabilizer (player) added to a mixture (scoper) in order to prevent the molecular disintegration of the main substance.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"10434"},{"code":"Name:Class","valueCode":"stabilizer"},{"code":"Name:Role:player:Entity","valueCode":"stabilizer&"},{"code":"Name:Role:scoper:Entity","valueCode":"stabilizerOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDDB____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDDB____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"MECH","display":"mechanical ingredient","definition":"An ingredient (player) of a medication (scoper) that is inseparable from the active ingredients, but has no intended chemical or pharmaceutical effect itself, but which may have some systemic effect on the patient.\r\n\r\nAn example is a collagen matrix used as a base for transplanting skin cells. The collagen matrix can be left permanently in the graft site. Because it is of bovine origin, the patient may exhibit allergies or may have cultural objections to its use.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"23060"},{"code":"Name:Class","valueCode":"mechanicalIngredient"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"LOCE","display":"located entity","definition":"Relates an entity (player) to a location (scoper) at which it is present in some way. This presence may be limited in time.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16815"},{"code":"Name:Class","valueCode":"locatedEntity"},{"code":"Name:Role:player:Entity","valueCode":"located(&|Entity)"},{"code":"Name:Role:scoper:Entity","valueCode":"location(&-PLC)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABE______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABE______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"STOR","display":"stored entity","definition":"Relates an entity (player) (e.g. a device) to a location (scoper) at which it is normally found or stored when not used.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16817"},{"code":"Name:Class","valueCode":"storedEntity"},{"code":"Name:Role:player:Entity","valueCode":"stored(&|Entity)"},{"code":"Name:Role:scoper:Entity","valueCode":"storageLocation(&-PLC)"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABEA_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABEA_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"MBR","display":"member","definition":"A role played by an entity that is a member of a group. The group provides the scope for this role.\r\n\r\nAmong other uses, groups as used in insurance (groups of covered individuals) and in scheduling where resources may be grouped for scheduling and logistical purposes.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"12204"},{"code":"Name:Class","valueCode":"member"},{"code":"Name:Role:player:Entity","valueCode":"member&"},{"code":"Name:Role:scoper:Entity","valueCode":"group&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABF______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABF______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PART","display":"part","definition":"**Definition:**  an association between two Entities where the playing Entity (the part) is a component of the whole (scoper) in the sense of an integral structural component, that is distinct from other parts in the same whole, has a distinct function in the whole, and, as an effect, the full integrity of the whole depends (to some degree) on the presence of this part, even though the part may often be separable from the whole.\r\n\r\n**Discussion:** Part is defined in opposition to (a) ingredient (not separable), (b) content (not a functional component), and (c) member (not functionally distinct from other members).","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19102"},{"code":"Name:Class","valueCode":"partOfWhole"},{"code":"Name:Role:player:Entity","valueCode":"part&"},{"code":"Name:Role:scoper:Entity","valueCode":"whole&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABC______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABC______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"ACTM","display":"active moiety","definition":"The molecule or ion that is responsible for the intended pharmacological action of the drug substance, excluding those appended or associated parts of the molecule that make the molecule an ester, salt (including a salt with hydrogen or coordination bonds), or other noncovalent derivative (such as a complex, chelate, or clathrate).\r\n\r\nExamples: heparin-sodium and heparin-potassium have the same active moiety, heparin; the active moiety of morphine-hydrochloride is morphine.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"19088"},{"code":"Name:Class","valueCode":"activeMoiety"},{"code":"Name:Role:player:Entity","valueCode":"activeMoiety"},{"code":"Name:Role:scoper:Entity","valueCode":"moietyOf&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABDB_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABDB_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]},{"code":"SPEC","display":"specimen","definition":"A role played by a material entity that is a specimen for an act. It is scoped by the source of the specimen.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"11591"},{"code":"Name:Class","valueCode":"specimen"},{"code":"Name:Role:player:Entity","valueCode":"specimen&"},{"code":"Name:Role:scoper:Entity","valueCode":"source&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABA______"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABA______"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}],"concept":[{"code":"ALQT","display":"aliquot","definition":"A portion (player) of an original or source specimen (scoper) used for testing or transportation.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"14026"},{"code":"Name:Class","valueCode":"aliquot"},{"code":"Name:Role:player:Entity","valueCode":"aliquot&"},{"code":"Name:Role:scoper:Entity","valueCode":"source&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABAA_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABAA_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"ISLT","display":"isolate","definition":"A microorganism that has been isolated from other microorganisms or a source matrix.","property":[{"code":"status","valueCode":"active"},{"code":"internalId","valueCode":"16302"},{"code":"Name:Class","valueCode":"isolate"},{"code":"Name:Role:player:Entity","valueCode":"isolate&"},{"code":"Name:Role:scoper:Entity","valueCode":"source&"},{"code":"Sort:Entity:playedRole:Role","valueCode":"ABAB_____"},{"code":"Sort:Entity:scopedRole:Role","valueCode":"ABAB_____"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]}]}]},{"code":"CHILD","display":"child","definition":"The player of the role is a child of the scoping entity, in a generic sense.","property":[{"code":"status","valueCode":"retired"},{"code":"internalId","valueCode":"11560"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"CRED","display":"credentialed entity","definition":"A role played by an entity that receives credentials from the scoping entity.","property":[{"code":"status","valueCode":"retired"},{"code":"internalId","valueCode":"16930"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"NURPRAC","display":"nurse practitioner","property":[{"code":"status","valueCode":"retired"},{"code":"internalId","valueCode":"11574"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"NURS","display":"nurse","property":[{"code":"status","valueCode":"retired"},{"code":"internalId","valueCode":"11573"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PA","display":"physician assistant","property":[{"code":"status","valueCode":"retired"},{"code":"internalId","valueCode":"11575"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]},{"code":"PHYS","display":"physician","property":[{"code":"status","valueCode":"retired"},{"code":"internalId","valueCode":"11572"},{"code":"Name:Entity:playedRole:Role","valueString":"as&"},{"code":"Name:Entity:scopedRole:Role","valueString":"&"},{"code":"Name:Participation:role:Role","valueString":"&"}]}]}