{
    "resourceType": "StructureDefinition",
    "id": "de-Binary.securityContext",
    "meta": {
        "lastUpdated": "2019-11-01T09:29:23.356+11:00"
    },
    "url": "http://hl7.org/fhir/StructureDefinition/de-Binary.securityContext",
    "version": "4.0.1",
    "name": "Binary.securityContext",
    "title": "Binary.securityContext",
    "status": "draft",
    "experimental": true,
    "date": "2019-11-01T09:29:23+11:00",
    "publisher": "HL7 FHIR Standard",
    "contact": [
        {
            "telecom": [
                {
                    "system": "url",
                    "value": "http://hl7.org/fhir"
                }
            ]
        }
    ],
    "description": "Data Element for Binary.securityContext",
    "purpose": "Data Elements are defined for each element to assist in questionnaire construction etc",
    "fhirVersion": "4.0.1",
    "mapping": [
        {
            "identity": "rim",
            "uri": "http://hl7.org/v3",
            "name": "RIM Mapping"
        }
    ],
    "kind": "logical",
    "abstract": false,
    "type": "Binary.securityContext",
    "baseDefinition": "http://hl7.org/fhir/StructureDefinition/Element",
    "derivation": "specialization",
    "snapshot": {
        "element": [
            {
                "id": "Binary.securityContext",
                "path": "Binary.securityContext",
                "short": "Identifies another resource to use as proxy when enforcing access control",
                "definition": "This element identifies another resource that can be used as a proxy of the security sensitivity to use when deciding and enforcing access control rules for the Binary resource. Given that the Binary resource contains very few elements that can be used to determine the sensitivity of the data and relationships to individuals, the referenced resource stands in as a proxy equivalent for this purpose. This referenced resource may be related to the Binary (e.g. Media, DocumentReference), or may be some non-related Resource purely as a security proxy. E.g. to identify that the binary resource relates to a patient, and access should only be granted to applications that have access to the patient.",
                "comment": "Very often, a server will also know of a resource that references the binary, and can automatically apply the appropriate access rules based on that reference. However, there are some circumstances where this is not appropriate, e.g. the binary is uploaded directly to the server without any linking resource, the binary is referred to from multiple different resources, and/or the binary is content such as an application logo that has less protection than any of the resources that reference it.",
                "min": 0,
                "max": "1",
                "base": {
                    "path": "Binary.securityContext",
                    "min": 0,
                    "max": "1"
                },
                "type": [
                    {
                        "code": "Reference",
                        "targetProfile": [
                            "http://hl7.org/fhir/StructureDefinition/Resource"
                        ]
                    }
                ],
                "isModifier": false,
                "isSummary": true,
                "mapping": [
                    {
                        "identity": "rim",
                        "map": "n/a"
                    }
                ]
            }
        ]
    }
}