{
    "resourceType": "CodeSystem",
    "id": "icpc2-icd10-THSRS",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://terminology.hl7.org/CodeSystem/icpc2-icd10-THSRS",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.6.142"
        }
    ],
    "version": "2.0.1",
    "name": "Icpc2Icd10THSRS",
    "title": "ICPC2-ICD10 Thesaurus",
    "status": "retired",
    "experimental": false,
    "date": "2021-11-09T10:00:00+10:00",
    "publisher": "TBD - External Body",
    "contact": [
        {
            "name": "WHO Collaborating Centre for the FIC in The Netherlands"
        }
    ],
    "description": "A diagnostic Terminology for semi-automatic Double Coding in Electronic Patient Records\r\n\r\nThe thesaurus is a part of the CD Rom: \"ICPC in the Amsterdam Transition Project. Extended Version. IM Okkes, SK Oskam, H. Lamberts. Amsterdam: Academic Medical Center/University of Amsterdam. Department of Family Medicine\", see also the web site http://www.transitieproject.nl for this application of the thesaurus.\r\n\r\nThis bilingual (English/Dutch) ICPC2-ICD10 thesaurus is derived from an extended version of the CD-Rom ICPC in the Amsterdam Transition Project, that was published as a companion to ICPC-2-R by Oxford University Press (2005). As was the case with the former thesaurus (published in Dutch in 2003), the content of this new thesaurus may be copied for academic purposes, and be used for teaching and research under the usual referencing conditions. Any other and/or commercial use requires prior permission from the authors, represented by Dr. Inge Okkes (see below).\r\n\r\nIt is strongly recommended that you first go through the ICPC Tutorial, the Manual and the Glossary, and consider printing them.\r\n\r\nBecker, H.W., C. van Boven, S.K. Oskam, I.M. Okkes, W. Hirs, H. Lamberts. ICPC2 - ICD10 Thesaurus, Version March, 2004. Amsterdam: Project \"Adaptation ICPC, integration and implementation of ICPC2 and ICD10(-CM).\" Department of General Practice, Academic",
    "caseSensitive": true,
    "content": "not-present"
}