{
    "resourceType": "CodeSystem",
    "id": "iso639-3",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://terminology.hl7.org/CodeSystem/iso639-3",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:1.0.639.3"
        }
    ],
    "version": "2.0.1",
    "name": "Iso6393",
    "title": "ISO 639-3 Language Codes Alpha 3",
    "status": "retired",
    "experimental": false,
    "date": "2021-11-09T10:00:00+10:00",
    "publisher": "TBD - External Body",
    "contact": [
        {
            "name": "SIL International"
        }
    ],
    "description": "**Description:** ISO 639-3 is a code that aims to define three-letter identifiers for all known human languages. At the core of ISO 639-3 are the individual languages already accounted for in ISO 639-2. The large number of living languages in the initial inventory of ISO 639-3 beyond those already included in ISO 639-2 was derived primarily from Ethnologue (15th edition). Additional extinct, ancient, historic, and constructed languages have been obtained from Linguist List.\r\n\r\nSIL International has been designated as the ISO 639-3/RA for the purpose of processing requests for alpha-3 language codes comprising the International Standard, Codes for the representation of names of languages - Part 3: Alpha-3 code for comprehensive coverage of languages. The ISO 639-3/RA receives and reviews applications for requesting new language codes and for the change of existing ones according to criteria indicated in the standard. It maintains an accurate list of information associated with registered language codes which can be viewed on or downloaded from this website, and processes updates of registered language codes. Notification of pending and adopted updates are also distributed on a regular basis to subscribers and other parties.",
    "caseSensitive": true,
    "content": "not-present"
}