{
    "resourceType": "CodeSystem",
    "id": "HPO",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://human-phenotype-ontology.org",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.6.339"
        }
    ],
    "version": "1.0.0",
    "name": "HPO",
    "title": "Human Phenotype Ontology",
    "status": "active",
    "experimental": false,
    "date": "2022-06-02T00:00:00-00:00",
    "contact": [
        {
            "name": "Peter Robinson or Melissa Haendel, The Monarch Initiative",
            "telecom": [
                {
                    "system": "url",
                    "value": "http://www.human-phenotype-ontology.org/"
                }
            ]
        }
    ],
    "description": "\"The Human Phenotype Ontology (HPO) provides a standardized vocabulary of phenotypic abnormalities encountered in human disease. Each term in the HPO describes a phenotypic abnormality, such as Atrial septal defect. The HPO is currently being developed using the medical literature, Orphanet, DECIPHER, and OMIM. HPO currently contains over 13,000 terms and over 156,000 annotations to hereditary diseases. The HPO project and others have developed software for phenotype-driven differential diagnostics, genomic diagnostics, and translational research. The HPO is a flagship product of the Monarch Initiative, an NIH-supported international consortium dedicated to semantic integration of biomedical and model organism data with the ultimate goal of improving biomedical research. The HPO, as a part of the Monarch Initiative, is a central component of one of the 13 driver projects in the Global Alliance for Genomics and Health (GA4GH) strategic roadmap.\"\r\n\r\nPlease see https://hpo.jax.org/app/download/ontology.\r\n\r\nReleases, produced approximately every 2 months, can be found [here](https://github.com/obophenotype/human-phenotype-ontology/releases).",
    "copyright": "The HPO vocabularies, annotation files, tools and documentation are freely available. \r\n\r\n1. The HPO is copyrighted to protect the integrity of the vocabularies, which means that changes to the HPO vocabularies need to be done by HPO developers. However, anyone can download the HPO and use the ontologies or other HPO files under three conditions:\r\n\r\n* That the Human Phenotype Ontology Consortium is acknowledged and [cited](https://hpo.jax.org/app/citation) properly.\r\n* That any HPO Consortium file(s) displayed publicly include the date(s) and/or version number(s) of the relevant HPO file(s).\r\n* That neither the content of the HPO file(s) nor the logical relationships embedded within the HPO file(s) be altered in any way. (Content additions and modifications have to be suggested using our [issue tracker](https://github.com/obophenotype/human-phenotype-ontology/issues).)\r\n2. Users of the HPO should add the following statement to their online presence. This service/product uses the Human Phenotype Ontology (version information). Find out more at http://www.human-phenotype-ontology.org. We request that the HPO logo be included as well.",
    "caseSensitive": true,
    "content": "not-present"
}