{
    "resourceType": "NamingSystem",
    "id": "iso21000-6-2004E-RDD",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "extension": [
        {
            "url": "http://hl7.org/fhir/tools/StructureDefinition/extension-title",
            "valueString": "ISO/IEC 21000-6:2004(E) Rights Data Dictionary"
        },
        {
            "url": "http://hl7.org/fhir/5.0/StructureDefinition/extension-NamingSystem.url",
            "valueUri": "http://terminology.hl7.org/NamingSystem/iso21000-6-2004E-RDD"
        },
        {
            "url": "http://terminology.hl7.org/StructureDefinition/ext-namingsystem-version",
            "valueString": "2.1.0"
        }
    ],
    "name": "Iso2100062004ERDD",
    "status": "retired",
    "kind": "codesystem",
    "date": "2021-11-09T10:00:00+10:00",
    "publisher": "ISO/IEC 21000-6 Registration Authority",
    "contact": [
        {
            "name": "ISO/IEC"
        }
    ],
    "responsible": "ISO/IEC 21000-6 Registration Authority",
    "description": "ISO/IEC 21000-6:2004 describes a Rights Data Dictionary which comprises a set of clear, consistent, structured, integrated and uniquely identified terms to support the MPEG-21 Rights Expression Language (REL), ISO/IEC 21000-5. Annex A specifies the methodology for and structure of the RDD Dictionary, and specifies how further Terms may be defined under the governance of a Registration Authority, requirements for which are described in Annex C.\r\n\r\nTaken together, these specifications and the RDD Dictionary and Database make up the RDD System. Use of the RDD System will facilitate the accurate exchange and processing of information between interested parties involved in the administration of rights in, and use of, Digital Items, and in particular it is intended to support ISO/IEC 21000-5 (REL). Clause 6 describes how ISO/IEC 21000-6:2004 relates to ISO/IEC 21000-5.\r\n\r\nAs well as providing definitions of terms for use in ISO/IEC 21000-5, the RDD System is designed to support the mapping of terms from different namespaces. Such mapping will enable the transformation of metadata from the terminology of one namespace (or Authority) into that of another namespace. Mapping, to ensure minimum ambiguity or loss of semantic integrity, will be the responsibility of the Registration Authority. Provision of automated trm look-up is also a requirement.\r\n\r\nThe RDD Dictionary is a prescriptive dctionary, in the sense that it defines a single meaning for a trm represented by a particular RddAuthorized TermName, but it is also inclusive in that it can recognize the prescription of other Headwords and definitions by other Authorities and incorporates them through mappings. The RDD Dictionary also supports the circumstance that the same name may have different meanings under different Authorities. ISO/IEC 21000-6:2004describes audit provisions so that additions, amendments and deletions to Terms and their attributes can be tracked.\r\n\r\nISO/IEC 21000-6:2004 recognizes legal definitions as and only as Terms from other Authorities that can be mapped into the RDD Dictionary. Therefore Terms that are directly authorized by the RDD Registration Authority neither define nor prescribe intellectual property rights or other legal entities.",
    "uniqueId": [
        {
            "type": "oid",
            "value": "1.0.21000.6",
            "preferred": true
        },
        {
            "type": "uri",
            "value": "http://terminology.hl7.org/CodeSystem/iso21000-6-2004E-RDD",
            "preferred": true
        }
    ]
}