{
    "resourceType": "NamingSystem",
    "id": "iso639-1",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "extension": [
        {
            "url": "http://hl7.org/fhir/tools/StructureDefinition/extension-title",
            "valueString": "ISO 639-1: Codes for the representation of names of languages -- Part 1: Alpha-2 code"
        },
        {
            "url": "http://hl7.org/fhir/5.0/StructureDefinition/extension-NamingSystem.url",
            "valueUri": "http://terminology.hl7.org/NamingSystem/iso639-1"
        },
        {
            "url": "http://terminology.hl7.org/StructureDefinition/ext-namingsystem-version",
            "valueString": "2.1.0"
        }
    ],
    "name": "Iso6391",
    "status": "retired",
    "kind": "codesystem",
    "date": "2021-11-09T10:00:00+10:00",
    "publisher": "ISO",
    "contact": [
        {
            "name": "International Organization for Standardization (ISO)"
        }
    ],
    "responsible": "ISO",
    "description": "**Description:** Codes for the Representation of Names of Languages Part 1: Alpha-2 Code. Used as part of the IETF 3066 specification for languages throughout the HL7 specification.\r\n\r\nThis part of ISO 639 provides a code consisting of language code elements comprising two-letter language identifiers for the representation of names of languages. The language identifiers according to this part of ISO 639 were devised originally for use in terminology, lexicography and linguistics, but may be adopted for any application requiring the expression of language in two- letter coded form, especially in computerized systems. The alpha-2 code was devised for practical use for most of the major languages of the world that are not only most frequently represented in the total body of the world's literature, but which also comprise a considerable volume of specialized languages and terminologies. Additional language identifiers are created when it becomes apparent that a significant body of documentation written in specialized languages and terminologies exists. Languages designed exclusively for machine use, such as computer-programming languages, are not included in this code.\r\n\r\nThe code set is available from http://www.iso.org/iso/iso\\_catalogue/catalogue\\_ics/catalogue\\_detail\\_ics.htm? csnumber=22109&ICS1=1&ICS2=140&ICS3=20",
    "uniqueId": [
        {
            "type": "oid",
            "value": "1.0.639.1",
            "preferred": true
        },
        {
            "type": "uri",
            "value": "http://terminology.hl7.org/CodeSystem/iso639-1",
            "preferred": true
        }
    ]
}