{
    "resourceType": "NamingSystem",
    "id": "RARC",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "extension": [
        {
            "url": "http://hl7.org/fhir/tools/StructureDefinition/extension-title",
            "valueString": "X12 Remittance Advice Remark Codes"
        },
        {
            "url": "http://hl7.org/fhir/5.0/StructureDefinition/extension-NamingSystem.url",
            "valueUri": "http://terminology.hl7.org/NamingSystem/RARC"
        },
        {
            "url": "http://terminology.hl7.org/StructureDefinition/ext-namingsystem-version",
            "valueString": "1.0.0"
        }
    ],
    "name": "RARC",
    "status": "active",
    "kind": "codesystem",
    "date": "2020-11-11T00:00:00-04:00",
    "publisher": "X12",
    "contact": [
        {
            "name": "X12",
            "telecom": [
                {
                    "system": "phone",
                    "value": "703.970.4480"
                },
                {
                    "system": "url",
                    "value": "https://x12.org/index.php/resources/contact-us"
                }
            ]
        }
    ],
    "responsible": "U.S. Centers for Medicare & Medicaid Services (CMS)",
    "description": "X12, chartered by the American National Standards Institute for more than 40 years, develops and maintains EDI standards and XML schemas which drive business processes globally. X12's diverse membership includes technologists and business process experts in health care, insurance, transportation, finance, government, supply chain and other industries.\r\n\r\nRemittance Advice Remark Codes (RARCs) are used to provide additional explanation for an adjustment already described by a Claim Adjustment Reason Code (CARC) or to convey information about remittance processing. Each RARC identifies a specific message as shown in the Remittance Advice Remark Code List. There are two types of RARCs, supplemental and informational. The majority of the RARCs are supplemental; these are generally referred to as RARCs without further distinction. Supplemental RARCs provide additional explanation for an adjustment already described by a CARC. The second type of RARC is informational; these RARCs are all prefaced with Alert: and are often referred to as Alerts. Alerts are used to convey information about remittance processing and are never related to a specific adjustment or CARC.",
    "uniqueId": [
        {
            "type": "uri",
            "value": "https://x12.org/codes/remittance-advice-remark-codes",
            "preferred": true
        }
    ]
}