{
    "resourceType": "NamingSystem",
    "id": "CMSRxHCC",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "extension": [
        {
            "url": "http://hl7.org/fhir/tools/StructureDefinition/extension-title",
            "valueString": "CMS Prescription Drug Hierarchical Condition Categories"
        },
        {
            "url": "http://hl7.org/fhir/5.0/StructureDefinition/extension-NamingSystem.url",
            "valueUri": "http://terminology.hl7.org/NamingSystem/CMSRxHCC"
        },
        {
            "url": "http://terminology.hl7.org/StructureDefinition/ext-namingsystem-version",
            "valueString": "1.0.0"
        }
    ],
    "name": "CMSRxHCC",
    "status": "active",
    "kind": "codesystem",
    "date": "2021-12-02T00:00:00-00:00",
    "publisher": "Centers for Medicare & Medicaid Services",
    "responsible": "Centers for Medicare & Medicaid Services",
    "description": "Starting in 2006, with the implementation of the Part D program, CMS introduced a second major HCC-based risk adjustment model. Created with the passage of the Medicare Modernization Act (MMA) of 2003, the Medicare Part D Prescription Drug benefit became the second major Medicare capitated payment system. CMS developed the Part D RxHCC risk adjustment model to apply to monthly capitated payments to both Medicare Advantage (MA-PDs) and standalone prescription drug plans (PDPs). The Part D RxHCC risk adjustment model implemented in 2006 was developed using a structure similar to the CMS-HCC model, in that it included demographic and diagnosis information clustered into hierarchical condition categories. CMS obtains diagnoses for all Medicare beneficiaries from either fee-for-service claims or Medicare Advantage reporting. In 2011, CMS implemented an updated Part D RxHCC risk adjustment model, incorporating program data derived from prescription drug event (PDE) data. The data used to calibrate this updated model was more recent cost and utilization data, resulting in a model that reflects more recent drug cost and utilization patterns.\r\n\r\nFor more information, see: https://www.cms.gov/Medicare/Health-Plans/MedicareAdvtgSpecRateStats/Risk-Adjustors\r\n\r\nThe CMS RxHCCs are in the public domain and are free to use without restriction.",
    "uniqueId": [
        {
            "type": "uri",
            "value": "http://terminology.hl7.org/CodeSystem/cmsrxhcc",
            "preferred": true,
            "period": {
                "start": "2021-12-02"
            }
        }
    ]
}