{
    "resourceType": "ValueSet",
    "id": "v2-0719",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://terminology.hl7.org/ValueSet/v2-0719",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.1.11.20428"
        }
    ],
    "version": "2.0.0",
    "name": "InformationSensitivityPolicy",
    "title": "InformationSensitivityPolicy",
    "status": "active",
    "experimental": false,
    "date": "2019-12-01",
    "publisher": "HL7, Inc",
    "contact": [
        {
            "telecom": [
                {
                    "system": "url",
                    "value": "https://github.com/HL7/UTG"
                }
            ]
        }
    ],
    "description": "Value Set of codes that specify the reason for the restricted access.\r\nSensitivity codes are not useful for interoperability outside of a policy domain because sensitivity policies are typically localized and vary drastically across policy domains even for the same information category because of differing organizational business rules, security policies, and jurisdictional requirements. For example, an \"employee\" sensitivity code would make little sense for use outside of a policy domain. \"Taboo\" would rarely be useful outside of a policy domain unless there are jurisdictional requirements requiring that a provider disclose sensitive information to a patient directly. Sensitivity codes may be more appropriate in a legacy system's Master Files in order to notify those who access a patient's orders and observations about the sensitivity policies that apply. Newer systems may have a security engine that uses a sensitivity policy's criteria directly. The specializable Sensitivity Act.code may be useful in some scenarious if used in combination with a sensitivity identifier and/or Act.titleValue Set of codes that specify the reason for the restricted access.",
    "copyright": "Copyright HL7. Licensed under creative commons public domain",
    "compose": {
        "include": [
            {
                "system": "http://terminology.hl7.org/CodeSystem/v3-ActCode",
                "version": "2.139.0"
            }
        ]
    }
}