{
    "resourceType": "ValueSet",
    "id": "v3-RoleClassSubscriber",
    "language": "en",
    "text": {
        "status": "empty",
        "div": "<div xmlns=\"http://www.w3.org/1999/xhtml\">Redacted for size</div>"
    },
    "url": "http://terminology.hl7.org/ValueSet/v3-RoleClassSubscriber",
    "identifier": [
        {
            "system": "urn:ietf:rfc:3986",
            "value": "urn:oid:2.16.840.1.113883.1.11.20175"
        }
    ],
    "version": "2.0.0",
    "name": "RoleClassSubscriber",
    "title": "RoleClassSubscriber",
    "status": "active",
    "experimental": false,
    "date": "2014-03-26",
    "description": "**Description:** A role played by a person covered under a policy based on association with a sponsor who is the policy holder, and whose association may provide for the eligibility of dependents for coverage.\r\n\r\n**Discussion:** The policy holder holds the contract with the policy or program underwriter. The subscriber holds a certificate of coverage under the contract. In legal proceedings concerning the policy or program, the terms of the contract takes precedence over the terms of the certificate of coverage if there are any inconsistencies.\r\n\r\n**Note:** The party playing the role of a subscriber is not a claimant in the sense conveyed by the RoleClassCoveredParty CLAIM (claimant). However, a subscriber may make a claim under a policy, e.g., a subscriber under a health insurance policy may become the claimant for coverage under that policy for wellness examines or if injured and there is no liable third party. In the case of a subscriber making a claim, a role type code INSCLM (insured claimant) subtypes the class to indicate that the subscriber has filed a claim for services covered under the health insurance policy.\r\n\r\n**Example:** An employee or a member of an association.",
    "immutable": true,
    "compose": {
        "include": [
            {
                "system": "http://terminology.hl7.org/CodeSystem/v3-RoleClass",
                "filter": [
                    {
                        "property": "concept",
                        "op": "is-a",
                        "value": "SUBSCR"
                    }
                ]
            }
        ]
    }
}